PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.2 *
       3;* Date/Time created: Thu Jan 28 12:38:40 2016                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --diag_wrap=off --endian=little --hll_source=on --object_format=elf 
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("../main.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.2 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/bwilcutt2/workspace_v6_1/PRU_SPIMCP/Debug")
      12        .global __PRU_CREG_MBX0
      13        .global __PRU_CREG_DDR
      14        .global __PRU_CREG_PRU_INTC
      15        .global __PRU_CREG_PRU_CFG
      16
      17$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
      18        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")
      19        .dwattr $C$DW$1, DW_AT_declaration
      20        .dwattr $C$DW$1, DW_AT_external
      21

    1105 00000088 000000230000C3!         JAL       r3.w2, ||pru_virtqueue_init|| ; [ALU_PRU] |296| pru_virtqueue_init
    1106        .dwpsn  file "../main.c",line 299,column 5,is_stmt,isa 0
    1107;* --------------------------------------------------------------------------*
    1108;*   BEGIN LOOP ||$C$L12||
    1109;*
    1110;*   Loop source line                : 299
    1111;*   Loop closing brace source line  : 299
    1112;*   Known Minimum Trip Count        : 1
    1113;*   Known Maximum Trip Count        : 4294967295
    1114;*   Known Max Trip Count Factor     : 1
    1115;* --------------------------------------------------------------------------*
    1116 0000008c                 ||$C$L12||:    
    1117        .dwpsn  file "../main.c",line 299,column 11,is_stmt,isa 0
    1118 0000008c 0000002400000E          LDI       r14.b0, 0x00          ; [ALU_PRU] |299| 
    1119 00000090 000000240000EF!         LDI       r15, ||transport||    ; [ALU_PRU] |299| transport
    1120 00000094 000090240000D0!         LDI32     r16, $C$SL1           ; [ALU_PRU] |299| 
         0000009b 00000021004024 
    1121 0000009c 000091240000D1!         LDI32     r17, $C$SL2           ; [ALU_PRU] |299| 
         000000a3 00000021004024 
    1122 000000a4 00000024001FF2          LDI       r18, 0x001f           ; [ALU_PRU] |299| 
    1123$C$DW$110       .dwtag  DW_TAG_TI_branch
    1124        .dwattr $C$DW$110, DW_AT_low_pc(0x00)
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   22

    1125        .dwattr $C$DW$110, DW_AT_name("pru_rpmsg_channel")
    1126        .dwattr $C$DW$110, DW_AT_TI_call
    1127 000000a8 000000230000C3!         JAL       r3.w2, ||pru_rpmsg_channel|| ; [ALU_PRU] |299| pru_rpmsg_channel
    1128 000000ac 0000006F008EF8          QBNE      ||$C$L12||, r14.w0, 0x00 ; [ALU_PRU] |299| 
    1129;* --------------------------------------------------------------------------*
    1130        .dwpsn  file "../main.c",line 300,column 1,is_stmt,isa 0
    1131 000000b0 000000F10402C3          LBBO      &r3.b2, r2, 4, 2      ; [ALU_PRU] 
    1132        .dwcfi  restore_reg, 14
    1133        .dwcfi  restore_reg, 15
    1134 000000b4 0000000106E2E2          ADD       r2, r2, 0x06          ; [ALU_PRU] 
    1135        .dwcfi  cfa_offset, 0
    1136$C$DW$111       .dwtag  DW_TAG_TI_branch
    1137        .dwattr $C$DW$111, DW_AT_low_pc(0x00)
    1138        .dwattr $C$DW$111, DW_AT_TI_return
    1139 000000b8 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
    1140        .dwattr $C$DW$106, DW_AT_TI_end_file("../main.c")
    1141        .dwattr $C$DW$106, DW_AT_TI_end_line(0x12c)
    1142        .dwattr $C$DW$106, DW_AT_TI_end_column(0x01)
    1143        .dwendentry
    1144        .dwendtag $C$DW$106
    1145
    1146;******************************************************************************
    1147;* STRINGS                                                                    *
    1148;******************************************************************************
    1149 00000000                         .sect   ".rodata:.string"
    1150 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-mcp3202",0
         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 0000000000006D 
         00000007 00000000000063 
         00000008 00000000000070 
         00000009 00000000000033 
         0000000a 00000000000032 
         0000000b 00000000000030 
         0000000c 00000000000032 
         0000000d 00000000000000 
    1151 0000000e 00000000000043  ||$C$SL2||:     .string "Channel 31",0
         0000000f 00000000000068 
         00000010 00000000000061 
         00000011 0000000000006E 
         00000012 0000000000006E 
         00000013 00000000000065 
         00000014 0000000000006C 
         00000015 00000000000020 
         00000016 00000000000033 
         00000017 00000000000031 
         00000018 00000000000000 
    1152;*****************************************************************************
    1153;* UNDEFINED EXTERNAL REFERENCES                                             *
    1154;*****************************************************************************
    1155        .global ||pru_virtqueue_init||
    1156        .global ||pru_rpmsg_channel||
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   23

    1157        .global ||SPI_ClkConfig||
    1158        .global ||SPI_WordLengthSet||
    1159        .global ||SPI_CSSet||
    1160        .global ||SPI_CSAssert||
    1161        .global ||SPI_CSDeAssert||
    1162        .global ||SPI_CSPolarityConfig||
    1163        .global ||SPI_MasterModeEnable||
    1164        .global ||SPI_MasterModeSet||
    1165        .global ||SPI_ChannelSet||
    1166        .global ||SPI_Reset||
    1167        .global ||SPI_TxFIFOConfig||
    1168        .global ||SPI_RxFIFOConfig||
    1169        .global ||SPI_TransmitData||
    1170        .global ||SPI_ReceiveData||
    1171        .global ||__pruabi_divu||
    1172
    1173;******************************************************************************
    1174;* TYPE INFORMATION                                                           *
    1175;******************************************************************************
    1176
    1177$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1178        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1179$C$DW$112       .dwtag  DW_TAG_member
    1180        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1181        .dwattr $C$DW$112, DW_AT_name("MINOR")
    1182        .dwattr $C$DW$112, DW_AT_TI_symbol_name("MINOR")
    1183        .dwattr $C$DW$112, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    1184        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1186        .dwattr $C$DW$112, DW_AT_decl_file("../sys_mailbox.h")
    1187        .dwattr $C$DW$112, DW_AT_decl_line(0x2d)
    1188        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1189$C$DW$113       .dwtag  DW_TAG_member
    1190        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1191        .dwattr $C$DW$113, DW_AT_name("CUSTOM")
    1192        .dwattr $C$DW$113, DW_AT_TI_symbol_name("CUSTOM")
    1193        .dwattr $C$DW$113, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    1194        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1196        .dwattr $C$DW$113, DW_AT_decl_file("../sys_mailbox.h")
    1197        .dwattr $C$DW$113, DW_AT_decl_line(0x2e)
    1198        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1199$C$DW$114       .dwtag  DW_TAG_member
    1200        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1201        .dwattr $C$DW$114, DW_AT_name("MAJOR")
    1202        .dwattr $C$DW$114, DW_AT_TI_symbol_name("MAJOR")
    1203        .dwattr $C$DW$114, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    1204        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1206        .dwattr $C$DW$114, DW_AT_decl_file("../sys_mailbox.h")
    1207        .dwattr $C$DW$114, DW_AT_decl_line(0x2f)
    1208        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1209$C$DW$115       .dwtag  DW_TAG_member
    1210        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1211        .dwattr $C$DW$115, DW_AT_name("RTL")
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   24

    1212        .dwattr $C$DW$115, DW_AT_TI_symbol_name("RTL")
    1213        .dwattr $C$DW$115, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    1214        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1216        .dwattr $C$DW$115, DW_AT_decl_file("../sys_mailbox.h")
    1217        .dwattr $C$DW$115, DW_AT_decl_line(0x30)
    1218        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1219$C$DW$116       .dwtag  DW_TAG_member
    1220        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1221        .dwattr $C$DW$116, DW_AT_name("FUNC")
    1222        .dwattr $C$DW$116, DW_AT_TI_symbol_name("FUNC")
    1223        .dwattr $C$DW$116, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    1224        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1226        .dwattr $C$DW$116, DW_AT_decl_file("../sys_mailbox.h")
    1227        .dwattr $C$DW$116, DW_AT_decl_line(0x31)
    1228        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1229$C$DW$117       .dwtag  DW_TAG_member
    1230        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1231        .dwattr $C$DW$117, DW_AT_name("rsvd28")
    1232        .dwattr $C$DW$117, DW_AT_TI_symbol_name("rsvd28")
    1233        .dwattr $C$DW$117, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1234        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1236        .dwattr $C$DW$117, DW_AT_decl_file("../sys_mailbox.h")
    1237        .dwattr $C$DW$117, DW_AT_decl_line(0x32)
    1238        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1239$C$DW$118       .dwtag  DW_TAG_member
    1240        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1241        .dwattr $C$DW$118, DW_AT_name("SCHEME")
    1242        .dwattr $C$DW$118, DW_AT_TI_symbol_name("SCHEME")
    1243        .dwattr $C$DW$118, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1244        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1246        .dwattr $C$DW$118, DW_AT_decl_file("../sys_mailbox.h")
    1247        .dwattr $C$DW$118, DW_AT_decl_line(0x33)
    1248        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1249        .dwendtag $C$DW$T$19
    1250
    1251        .dwattr $C$DW$T$19, DW_AT_decl_file("../sys_mailbox.h")
    1252        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1253        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1254$C$DW$T$216     .dwtag  DW_TAG_volatile_type
    1255        .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$19)
    1256
    1257$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1258        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1259$C$DW$119       .dwtag  DW_TAG_member
    1260        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1261        .dwattr $C$DW$119, DW_AT_name("SOFTRESET")
    1262        .dwattr $C$DW$119, DW_AT_TI_symbol_name("SOFTRESET")
    1263        .dwattr $C$DW$119, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1264        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1265        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1266        .dwattr $C$DW$119, DW_AT_decl_file("../sys_mailbox.h")
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   25

    1267        .dwattr $C$DW$119, DW_AT_decl_line(0x3e)
    1268        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1269$C$DW$120       .dwtag  DW_TAG_member
    1270        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1271        .dwattr $C$DW$120, DW_AT_name("rsvd")
    1272        .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd")
    1273        .dwattr $C$DW$120, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1274        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1275        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1276        .dwattr $C$DW$120, DW_AT_decl_file("../sys_mailbox.h")
    1277        .dwattr $C$DW$120, DW_AT_decl_line(0x3f)
    1278        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1279$C$DW$121       .dwtag  DW_TAG_member
    1280        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1281        .dwattr $C$DW$121, DW_AT_name("SLIDLEMODE")
    1282        .dwattr $C$DW$121, DW_AT_TI_symbol_name("SLIDLEMODE")
    1283        .dwattr $C$DW$121, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1284        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1286        .dwattr $C$DW$121, DW_AT_decl_file("../sys_mailbox.h")
    1287        .dwattr $C$DW$121, DW_AT_decl_line(0x40)
    1288        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1289$C$DW$122       .dwtag  DW_TAG_member
    1290        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1291        .dwattr $C$DW$122, DW_AT_name("rsvd1")
    1292        .dwattr $C$DW$122, DW_AT_TI_symbol_name("rsvd1")
    1293        .dwattr $C$DW$122, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    1294        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1296        .dwattr $C$DW$122, DW_AT_decl_file("../sys_mailbox.h")
    1297        .dwattr $C$DW$122, DW_AT_decl_line(0x41)
    1298        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1299        .dwendtag $C$DW$T$20
    1300
    1301        .dwattr $C$DW$T$20, DW_AT_decl_file("../sys_mailbox.h")
    1302        .dwattr $C$DW$T$20, DW_AT_decl_line(0x3d)
    1303        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1304$C$DW$T$218     .dwtag  DW_TAG_volatile_type
    1305        .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$20)
    1306
    1307$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1308        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1309$C$DW$123       .dwtag  DW_TAG_member
    1310        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1311        .dwattr $C$DW$123, DW_AT_name("MESSAGE")
    1312        .dwattr $C$DW$123, DW_AT_TI_symbol_name("MESSAGE")
    1313        .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1314        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1316        .dwattr $C$DW$123, DW_AT_decl_file("../sys_mailbox.h")
    1317        .dwattr $C$DW$123, DW_AT_decl_line(0x4c)
    1318        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1319        .dwendtag $C$DW$T$21
    1320
    1321        .dwattr $C$DW$T$21, DW_AT_decl_file("../sys_mailbox.h")
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   26

    1322        .dwattr $C$DW$T$21, DW_AT_decl_line(0x4b)
    1323        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1324$C$DW$T$221     .dwtag  DW_TAG_volatile_type
    1325        .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$21)
    1326
    1327$C$DW$T$222     .dwtag  DW_TAG_array_type
    1328        .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    1329        .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    1330        .dwattr $C$DW$T$222, DW_AT_byte_size(0x20)
    1331$C$DW$124       .dwtag  DW_TAG_subrange_type
    1332        .dwattr $C$DW$124, DW_AT_upper_bound(0x07)
    1333        .dwendtag $C$DW$T$222
    1334
    1335
    1336$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1337        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1338$C$DW$125       .dwtag  DW_TAG_member
    1339        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1340        .dwattr $C$DW$125, DW_AT_name("FIFOFULL")
    1341        .dwattr $C$DW$125, DW_AT_TI_symbol_name("FIFOFULL")
    1342        .dwattr $C$DW$125, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1343        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1345        .dwattr $C$DW$125, DW_AT_decl_file("../sys_mailbox.h")
    1346        .dwattr $C$DW$125, DW_AT_decl_line(0x57)
    1347        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1348$C$DW$126       .dwtag  DW_TAG_member
    1349        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1350        .dwattr $C$DW$126, DW_AT_name("rsvd")
    1351        .dwattr $C$DW$126, DW_AT_TI_symbol_name("rsvd")
    1352        .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1353        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1354        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1355        .dwattr $C$DW$126, DW_AT_decl_file("../sys_mailbox.h")
    1356        .dwattr $C$DW$126, DW_AT_decl_line(0x58)
    1357        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1358        .dwendtag $C$DW$T$22
    1359
    1360        .dwattr $C$DW$T$22, DW_AT_decl_file("../sys_mailbox.h")
    1361        .dwattr $C$DW$T$22, DW_AT_decl_line(0x56)
    1362        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1363$C$DW$T$224     .dwtag  DW_TAG_volatile_type
    1364        .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$22)
    1365
    1366$C$DW$T$225     .dwtag  DW_TAG_array_type
    1367        .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    1368        .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    1369        .dwattr $C$DW$T$225, DW_AT_byte_size(0x20)
    1370$C$DW$127       .dwtag  DW_TAG_subrange_type
    1371        .dwattr $C$DW$127, DW_AT_upper_bound(0x07)
    1372        .dwendtag $C$DW$T$225
    1373
    1374
    1375$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1376        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   27

    1377$C$DW$128       .dwtag  DW_TAG_member
    1378        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1379        .dwattr $C$DW$128, DW_AT_name("NBOFMSG")
    1380        .dwattr $C$DW$128, DW_AT_TI_symbol_name("NBOFMSG")
    1381        .dwattr $C$DW$128, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x03)
    1382        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1384        .dwattr $C$DW$128, DW_AT_decl_file("../sys_mailbox.h")
    1385        .dwattr $C$DW$128, DW_AT_decl_line(0x63)
    1386        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    1387$C$DW$129       .dwtag  DW_TAG_member
    1388        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    1389        .dwattr $C$DW$129, DW_AT_name("rsvd")
    1390        .dwattr $C$DW$129, DW_AT_TI_symbol_name("rsvd")
    1391        .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1d)
    1392        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1394        .dwattr $C$DW$129, DW_AT_decl_file("../sys_mailbox.h")
    1395        .dwattr $C$DW$129, DW_AT_decl_line(0x64)
    1396        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    1397        .dwendtag $C$DW$T$23
    1398
    1399        .dwattr $C$DW$T$23, DW_AT_decl_file("../sys_mailbox.h")
    1400        .dwattr $C$DW$T$23, DW_AT_decl_line(0x62)
    1401        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1402$C$DW$T$227     .dwtag  DW_TAG_volatile_type
    1403        .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$23)
    1404
    1405$C$DW$T$228     .dwtag  DW_TAG_array_type
    1406        .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    1407        .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    1408        .dwattr $C$DW$T$228, DW_AT_byte_size(0x20)
    1409$C$DW$130       .dwtag  DW_TAG_subrange_type
    1410        .dwattr $C$DW$130, DW_AT_upper_bound(0x07)
    1411        .dwendtag $C$DW$T$228
    1412
    1413
    1414$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1415        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1416$C$DW$131       .dwtag  DW_TAG_member
    1417        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    1418        .dwattr $C$DW$131, DW_AT_name("NEWMSGSTATUSMB0")
    1419        .dwattr $C$DW$131, DW_AT_TI_symbol_name("NEWMSGSTATUSMB0")
    1420        .dwattr $C$DW$131, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1421        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1422        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1423        .dwattr $C$DW$131, DW_AT_decl_file("../sys_mailbox.h")
    1424        .dwattr $C$DW$131, DW_AT_decl_line(0x6f)
    1425        .dwattr $C$DW$131, DW_AT_decl_column(0x0e)
    1426$C$DW$132       .dwtag  DW_TAG_member
    1427        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    1428        .dwattr $C$DW$132, DW_AT_name("NOTFULLSTATUSMB0")
    1429        .dwattr $C$DW$132, DW_AT_TI_symbol_name("NOTFULLSTATUSMB0")
    1430        .dwattr $C$DW$132, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1431        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1432        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1433        .dwattr $C$DW$132, DW_AT_decl_file("../sys_mailbox.h")
    1434        .dwattr $C$DW$132, DW_AT_decl_line(0x70)
    1435        .dwattr $C$DW$132, DW_AT_decl_column(0x0e)
    1436$C$DW$133       .dwtag  DW_TAG_member
    1437        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    1438        .dwattr $C$DW$133, DW_AT_name("NEWMSGSTATUSMB1")
    1439        .dwattr $C$DW$133, DW_AT_TI_symbol_name("NEWMSGSTATUSMB1")
    1440        .dwattr $C$DW$133, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1441        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1443        .dwattr $C$DW$133, DW_AT_decl_file("../sys_mailbox.h")
    1444        .dwattr $C$DW$133, DW_AT_decl_line(0x71)
    1445        .dwattr $C$DW$133, DW_AT_decl_column(0x0e)
    1446$C$DW$134       .dwtag  DW_TAG_member
    1447        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    1448        .dwattr $C$DW$134, DW_AT_name("NOTFULLSTATUSMB1")
    1449        .dwattr $C$DW$134, DW_AT_TI_symbol_name("NOTFULLSTATUSMB1")
    1450        .dwattr $C$DW$134, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1451        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1453        .dwattr $C$DW$134, DW_AT_decl_file("../sys_mailbox.h")
    1454        .dwattr $C$DW$134, DW_AT_decl_line(0x72)
    1455        .dwattr $C$DW$134, DW_AT_decl_column(0x0e)
    1456$C$DW$135       .dwtag  DW_TAG_member
    1457        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    1458        .dwattr $C$DW$135, DW_AT_name("NEWMSGSTATUSMB2")
    1459        .dwattr $C$DW$135, DW_AT_TI_symbol_name("NEWMSGSTATUSMB2")
    1460        .dwattr $C$DW$135, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1461        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1463        .dwattr $C$DW$135, DW_AT_decl_file("../sys_mailbox.h")
    1464        .dwattr $C$DW$135, DW_AT_decl_line(0x73)
    1465        .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    1466$C$DW$136       .dwtag  DW_TAG_member
    1467        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    1468        .dwattr $C$DW$136, DW_AT_name("NOTFULLSTATUSMB2")
    1469        .dwattr $C$DW$136, DW_AT_TI_symbol_name("NOTFULLSTATUSMB2")
    1470        .dwattr $C$DW$136, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1471        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1473        .dwattr $C$DW$136, DW_AT_decl_file("../sys_mailbox.h")
    1474        .dwattr $C$DW$136, DW_AT_decl_line(0x74)
    1475        .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    1476$C$DW$137       .dwtag  DW_TAG_member
    1477        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    1478        .dwattr $C$DW$137, DW_AT_name("NEWMSGSTATUSMB3")
    1479        .dwattr $C$DW$137, DW_AT_TI_symbol_name("NEWMSGSTATUSMB3")
    1480        .dwattr $C$DW$137, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1481        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1483        .dwattr $C$DW$137, DW_AT_decl_file("../sys_mailbox.h")
    1484        .dwattr $C$DW$137, DW_AT_decl_line(0x75)
    1485        .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    1486$C$DW$138       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   29

    1487        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    1488        .dwattr $C$DW$138, DW_AT_name("NOTFULLSTATUSMB3")
    1489        .dwattr $C$DW$138, DW_AT_TI_symbol_name("NOTFULLSTATUSMB3")
    1490        .dwattr $C$DW$138, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1491        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1493        .dwattr $C$DW$138, DW_AT_decl_file("../sys_mailbox.h")
    1494        .dwattr $C$DW$138, DW_AT_decl_line(0x76)
    1495        .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    1496$C$DW$139       .dwtag  DW_TAG_member
    1497        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    1498        .dwattr $C$DW$139, DW_AT_name("NEWMSGSTATUSMB4")
    1499        .dwattr $C$DW$139, DW_AT_TI_symbol_name("NEWMSGSTATUSMB4")
    1500        .dwattr $C$DW$139, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1501        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1503        .dwattr $C$DW$139, DW_AT_decl_file("../sys_mailbox.h")
    1504        .dwattr $C$DW$139, DW_AT_decl_line(0x77)
    1505        .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    1506$C$DW$140       .dwtag  DW_TAG_member
    1507        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    1508        .dwattr $C$DW$140, DW_AT_name("NOTFULLSTATUSMB4")
    1509        .dwattr $C$DW$140, DW_AT_TI_symbol_name("NOTFULLSTATUSMB4")
    1510        .dwattr $C$DW$140, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1511        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1513        .dwattr $C$DW$140, DW_AT_decl_file("../sys_mailbox.h")
    1514        .dwattr $C$DW$140, DW_AT_decl_line(0x78)
    1515        .dwattr $C$DW$140, DW_AT_decl_column(0x0e)
    1516$C$DW$141       .dwtag  DW_TAG_member
    1517        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
    1518        .dwattr $C$DW$141, DW_AT_name("NEWMSGSTATUSMB5")
    1519        .dwattr $C$DW$141, DW_AT_TI_symbol_name("NEWMSGSTATUSMB5")
    1520        .dwattr $C$DW$141, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1521        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1523        .dwattr $C$DW$141, DW_AT_decl_file("../sys_mailbox.h")
    1524        .dwattr $C$DW$141, DW_AT_decl_line(0x79)
    1525        .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    1526$C$DW$142       .dwtag  DW_TAG_member
    1527        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$11)
    1528        .dwattr $C$DW$142, DW_AT_name("NOTFULLSTATUSMB5")
    1529        .dwattr $C$DW$142, DW_AT_TI_symbol_name("NOTFULLSTATUSMB5")
    1530        .dwattr $C$DW$142, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1531        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1532        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1533        .dwattr $C$DW$142, DW_AT_decl_file("../sys_mailbox.h")
    1534        .dwattr $C$DW$142, DW_AT_decl_line(0x7a)
    1535        .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    1536$C$DW$143       .dwtag  DW_TAG_member
    1537        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$11)
    1538        .dwattr $C$DW$143, DW_AT_name("NEWMSGSTATUSMB6")
    1539        .dwattr $C$DW$143, DW_AT_TI_symbol_name("NEWMSGSTATUSMB6")
    1540        .dwattr $C$DW$143, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1541        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   30

    1542        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1543        .dwattr $C$DW$143, DW_AT_decl_file("../sys_mailbox.h")
    1544        .dwattr $C$DW$143, DW_AT_decl_line(0x7b)
    1545        .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    1546$C$DW$144       .dwtag  DW_TAG_member
    1547        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$11)
    1548        .dwattr $C$DW$144, DW_AT_name("NOTFULLSTATUSMB6")
    1549        .dwattr $C$DW$144, DW_AT_TI_symbol_name("NOTFULLSTATUSMB6")
    1550        .dwattr $C$DW$144, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1551        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1553        .dwattr $C$DW$144, DW_AT_decl_file("../sys_mailbox.h")
    1554        .dwattr $C$DW$144, DW_AT_decl_line(0x7c)
    1555        .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    1556$C$DW$145       .dwtag  DW_TAG_member
    1557        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$11)
    1558        .dwattr $C$DW$145, DW_AT_name("NEWMSGSTATUSMB7")
    1559        .dwattr $C$DW$145, DW_AT_TI_symbol_name("NEWMSGSTATUSMB7")
    1560        .dwattr $C$DW$145, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1561        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1563        .dwattr $C$DW$145, DW_AT_decl_file("../sys_mailbox.h")
    1564        .dwattr $C$DW$145, DW_AT_decl_line(0x7d)
    1565        .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    1566$C$DW$146       .dwtag  DW_TAG_member
    1567        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$11)
    1568        .dwattr $C$DW$146, DW_AT_name("NOTFULLSTATUSMB7")
    1569        .dwattr $C$DW$146, DW_AT_TI_symbol_name("NOTFULLSTATUSMB7")
    1570        .dwattr $C$DW$146, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1571        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1573        .dwattr $C$DW$146, DW_AT_decl_file("../sys_mailbox.h")
    1574        .dwattr $C$DW$146, DW_AT_decl_line(0x7e)
    1575        .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    1576$C$DW$147       .dwtag  DW_TAG_member
    1577        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$11)
    1578        .dwattr $C$DW$147, DW_AT_name("rsvd")
    1579        .dwattr $C$DW$147, DW_AT_TI_symbol_name("rsvd")
    1580        .dwattr $C$DW$147, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1581        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1583        .dwattr $C$DW$147, DW_AT_decl_file("../sys_mailbox.h")
    1584        .dwattr $C$DW$147, DW_AT_decl_line(0x7f)
    1585        .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    1586        .dwendtag $C$DW$T$24
    1587
    1588        .dwattr $C$DW$T$24, DW_AT_decl_file("../sys_mailbox.h")
    1589        .dwattr $C$DW$T$24, DW_AT_decl_line(0x6e)
    1590        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1591$C$DW$T$230     .dwtag  DW_TAG_volatile_type
    1592        .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$24)
    1593
    1594$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1595        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1596$C$DW$148       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   31

    1597        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$11)
    1598        .dwattr $C$DW$148, DW_AT_name("NEWMSGSTATUSMB0")
    1599        .dwattr $C$DW$148, DW_AT_TI_symbol_name("NEWMSGSTATUSMB0")
    1600        .dwattr $C$DW$148, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1601        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1603        .dwattr $C$DW$148, DW_AT_decl_file("../sys_mailbox.h")
    1604        .dwattr $C$DW$148, DW_AT_decl_line(0x86)
    1605        .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    1606$C$DW$149       .dwtag  DW_TAG_member
    1607        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$11)
    1608        .dwattr $C$DW$149, DW_AT_name("NOTFULLSTATUSMB0")
    1609        .dwattr $C$DW$149, DW_AT_TI_symbol_name("NOTFULLSTATUSMB0")
    1610        .dwattr $C$DW$149, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1611        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1613        .dwattr $C$DW$149, DW_AT_decl_file("../sys_mailbox.h")
    1614        .dwattr $C$DW$149, DW_AT_decl_line(0x87)
    1615        .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    1616$C$DW$150       .dwtag  DW_TAG_member
    1617        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$11)
    1618        .dwattr $C$DW$150, DW_AT_name("NEWMSGSTATUSMB1")
    1619        .dwattr $C$DW$150, DW_AT_TI_symbol_name("NEWMSGSTATUSMB1")
    1620        .dwattr $C$DW$150, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1621        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1623        .dwattr $C$DW$150, DW_AT_decl_file("../sys_mailbox.h")
    1624        .dwattr $C$DW$150, DW_AT_decl_line(0x88)
    1625        .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    1626$C$DW$151       .dwtag  DW_TAG_member
    1627        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$11)
    1628        .dwattr $C$DW$151, DW_AT_name("NOTFULLSTATUSMB1")
    1629        .dwattr $C$DW$151, DW_AT_TI_symbol_name("NOTFULLSTATUSMB1")
    1630        .dwattr $C$DW$151, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1631        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1632        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1633        .dwattr $C$DW$151, DW_AT_decl_file("../sys_mailbox.h")
    1634        .dwattr $C$DW$151, DW_AT_decl_line(0x89)
    1635        .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    1636$C$DW$152       .dwtag  DW_TAG_member
    1637        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
    1638        .dwattr $C$DW$152, DW_AT_name("NEWMSGSTATUSMB2")
    1639        .dwattr $C$DW$152, DW_AT_TI_symbol_name("NEWMSGSTATUSMB2")
    1640        .dwattr $C$DW$152, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1641        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1643        .dwattr $C$DW$152, DW_AT_decl_file("../sys_mailbox.h")
    1644        .dwattr $C$DW$152, DW_AT_decl_line(0x8a)
    1645        .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    1646$C$DW$153       .dwtag  DW_TAG_member
    1647        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    1648        .dwattr $C$DW$153, DW_AT_name("NOTFULLSTATUSMB2")
    1649        .dwattr $C$DW$153, DW_AT_TI_symbol_name("NOTFULLSTATUSMB2")
    1650        .dwattr $C$DW$153, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1651        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   32

    1652        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1653        .dwattr $C$DW$153, DW_AT_decl_file("../sys_mailbox.h")
    1654        .dwattr $C$DW$153, DW_AT_decl_line(0x8b)
    1655        .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    1656$C$DW$154       .dwtag  DW_TAG_member
    1657        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    1658        .dwattr $C$DW$154, DW_AT_name("NEWMSGSTATUSMB3")
    1659        .dwattr $C$DW$154, DW_AT_TI_symbol_name("NEWMSGSTATUSMB3")
    1660        .dwattr $C$DW$154, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1661        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1663        .dwattr $C$DW$154, DW_AT_decl_file("../sys_mailbox.h")
    1664        .dwattr $C$DW$154, DW_AT_decl_line(0x8c)
    1665        .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    1666$C$DW$155       .dwtag  DW_TAG_member
    1667        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    1668        .dwattr $C$DW$155, DW_AT_name("NOTFULLSTATUSMB3")
    1669        .dwattr $C$DW$155, DW_AT_TI_symbol_name("NOTFULLSTATUSMB3")
    1670        .dwattr $C$DW$155, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1671        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1673        .dwattr $C$DW$155, DW_AT_decl_file("../sys_mailbox.h")
    1674        .dwattr $C$DW$155, DW_AT_decl_line(0x8d)
    1675        .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    1676$C$DW$156       .dwtag  DW_TAG_member
    1677        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    1678        .dwattr $C$DW$156, DW_AT_name("NEWMSGSTATUSMB4")
    1679        .dwattr $C$DW$156, DW_AT_TI_symbol_name("NEWMSGSTATUSMB4")
    1680        .dwattr $C$DW$156, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1681        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1683        .dwattr $C$DW$156, DW_AT_decl_file("../sys_mailbox.h")
    1684        .dwattr $C$DW$156, DW_AT_decl_line(0x8e)
    1685        .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    1686$C$DW$157       .dwtag  DW_TAG_member
    1687        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    1688        .dwattr $C$DW$157, DW_AT_name("NOTFULLSTATUSMB4")
    1689        .dwattr $C$DW$157, DW_AT_TI_symbol_name("NOTFULLSTATUSMB4")
    1690        .dwattr $C$DW$157, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1691        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1693        .dwattr $C$DW$157, DW_AT_decl_file("../sys_mailbox.h")
    1694        .dwattr $C$DW$157, DW_AT_decl_line(0x8f)
    1695        .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    1696$C$DW$158       .dwtag  DW_TAG_member
    1697        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    1698        .dwattr $C$DW$158, DW_AT_name("NEWMSGSTATUSMB5")
    1699        .dwattr $C$DW$158, DW_AT_TI_symbol_name("NEWMSGSTATUSMB5")
    1700        .dwattr $C$DW$158, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1701        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1703        .dwattr $C$DW$158, DW_AT_decl_file("../sys_mailbox.h")
    1704        .dwattr $C$DW$158, DW_AT_decl_line(0x90)
    1705        .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    1706$C$DW$159       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   33

    1707        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    1708        .dwattr $C$DW$159, DW_AT_name("NOTFULLSTATUSMB5")
    1709        .dwattr $C$DW$159, DW_AT_TI_symbol_name("NOTFULLSTATUSMB5")
    1710        .dwattr $C$DW$159, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1711        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1713        .dwattr $C$DW$159, DW_AT_decl_file("../sys_mailbox.h")
    1714        .dwattr $C$DW$159, DW_AT_decl_line(0x91)
    1715        .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    1716$C$DW$160       .dwtag  DW_TAG_member
    1717        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    1718        .dwattr $C$DW$160, DW_AT_name("NEWMSGSTATUSMB6")
    1719        .dwattr $C$DW$160, DW_AT_TI_symbol_name("NEWMSGSTATUSMB6")
    1720        .dwattr $C$DW$160, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1721        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1723        .dwattr $C$DW$160, DW_AT_decl_file("../sys_mailbox.h")
    1724        .dwattr $C$DW$160, DW_AT_decl_line(0x92)
    1725        .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    1726$C$DW$161       .dwtag  DW_TAG_member
    1727        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    1728        .dwattr $C$DW$161, DW_AT_name("NOTFULLSTATUSMB6")
    1729        .dwattr $C$DW$161, DW_AT_TI_symbol_name("NOTFULLSTATUSMB6")
    1730        .dwattr $C$DW$161, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1731        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1733        .dwattr $C$DW$161, DW_AT_decl_file("../sys_mailbox.h")
    1734        .dwattr $C$DW$161, DW_AT_decl_line(0x93)
    1735        .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    1736$C$DW$162       .dwtag  DW_TAG_member
    1737        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    1738        .dwattr $C$DW$162, DW_AT_name("NEWMSGSTATUSMB7")
    1739        .dwattr $C$DW$162, DW_AT_TI_symbol_name("NEWMSGSTATUSMB7")
    1740        .dwattr $C$DW$162, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1741        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1742        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1743        .dwattr $C$DW$162, DW_AT_decl_file("../sys_mailbox.h")
    1744        .dwattr $C$DW$162, DW_AT_decl_line(0x94)
    1745        .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    1746$C$DW$163       .dwtag  DW_TAG_member
    1747        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    1748        .dwattr $C$DW$163, DW_AT_name("NOTFULLSTATUSMB7")
    1749        .dwattr $C$DW$163, DW_AT_TI_symbol_name("NOTFULLSTATUSMB7")
    1750        .dwattr $C$DW$163, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1751        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1752        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1753        .dwattr $C$DW$163, DW_AT_decl_file("../sys_mailbox.h")
    1754        .dwattr $C$DW$163, DW_AT_decl_line(0x95)
    1755        .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    1756$C$DW$164       .dwtag  DW_TAG_member
    1757        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    1758        .dwattr $C$DW$164, DW_AT_name("rsvd")
    1759        .dwattr $C$DW$164, DW_AT_TI_symbol_name("rsvd")
    1760        .dwattr $C$DW$164, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1761        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   34

    1762        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1763        .dwattr $C$DW$164, DW_AT_decl_file("../sys_mailbox.h")
    1764        .dwattr $C$DW$164, DW_AT_decl_line(0x96)
    1765        .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    1766        .dwendtag $C$DW$T$25
    1767
    1768        .dwattr $C$DW$T$25, DW_AT_decl_file("../sys_mailbox.h")
    1769        .dwattr $C$DW$T$25, DW_AT_decl_line(0x85)
    1770        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1771$C$DW$T$232     .dwtag  DW_TAG_volatile_type
    1772        .dwattr $C$DW$T$232, DW_AT_type(*$C$DW$T$25)
    1773
    1774$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1775        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1776$C$DW$165       .dwtag  DW_TAG_member
    1777        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    1778        .dwattr $C$DW$165, DW_AT_name("NEWMSGSTATUSMB0")
    1779        .dwattr $C$DW$165, DW_AT_TI_symbol_name("NEWMSGSTATUSMB0")
    1780        .dwattr $C$DW$165, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1781        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1782        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1783        .dwattr $C$DW$165, DW_AT_decl_file("../sys_mailbox.h")
    1784        .dwattr $C$DW$165, DW_AT_decl_line(0x9d)
    1785        .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    1786$C$DW$166       .dwtag  DW_TAG_member
    1787        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    1788        .dwattr $C$DW$166, DW_AT_name("NOTFULLSTATUSMB0")
    1789        .dwattr $C$DW$166, DW_AT_TI_symbol_name("NOTFULLSTATUSMB0")
    1790        .dwattr $C$DW$166, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1791        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1792        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1793        .dwattr $C$DW$166, DW_AT_decl_file("../sys_mailbox.h")
    1794        .dwattr $C$DW$166, DW_AT_decl_line(0x9e)
    1795        .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    1796$C$DW$167       .dwtag  DW_TAG_member
    1797        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    1798        .dwattr $C$DW$167, DW_AT_name("NEWMSGSTATUSMB1")
    1799        .dwattr $C$DW$167, DW_AT_TI_symbol_name("NEWMSGSTATUSMB1")
    1800        .dwattr $C$DW$167, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1801        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1802        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1803        .dwattr $C$DW$167, DW_AT_decl_file("../sys_mailbox.h")
    1804        .dwattr $C$DW$167, DW_AT_decl_line(0x9f)
    1805        .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    1806$C$DW$168       .dwtag  DW_TAG_member
    1807        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    1808        .dwattr $C$DW$168, DW_AT_name("NOTFULLSTATUSMB1")
    1809        .dwattr $C$DW$168, DW_AT_TI_symbol_name("NOTFULLSTATUSMB1")
    1810        .dwattr $C$DW$168, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1811        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1812        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1813        .dwattr $C$DW$168, DW_AT_decl_file("../sys_mailbox.h")
    1814        .dwattr $C$DW$168, DW_AT_decl_line(0xa0)
    1815        .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    1816$C$DW$169       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   35

    1817        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    1818        .dwattr $C$DW$169, DW_AT_name("NEWMSGSTATUSMB2")
    1819        .dwattr $C$DW$169, DW_AT_TI_symbol_name("NEWMSGSTATUSMB2")
    1820        .dwattr $C$DW$169, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1821        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1823        .dwattr $C$DW$169, DW_AT_decl_file("../sys_mailbox.h")
    1824        .dwattr $C$DW$169, DW_AT_decl_line(0xa1)
    1825        .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    1826$C$DW$170       .dwtag  DW_TAG_member
    1827        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$11)
    1828        .dwattr $C$DW$170, DW_AT_name("NOTFULLSTATUSMB2")
    1829        .dwattr $C$DW$170, DW_AT_TI_symbol_name("NOTFULLSTATUSMB2")
    1830        .dwattr $C$DW$170, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1831        .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832        .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1833        .dwattr $C$DW$170, DW_AT_decl_file("../sys_mailbox.h")
    1834        .dwattr $C$DW$170, DW_AT_decl_line(0xa2)
    1835        .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    1836$C$DW$171       .dwtag  DW_TAG_member
    1837        .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$11)
    1838        .dwattr $C$DW$171, DW_AT_name("NEWMSGSTATUSMB3")
    1839        .dwattr $C$DW$171, DW_AT_TI_symbol_name("NEWMSGSTATUSMB3")
    1840        .dwattr $C$DW$171, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1841        .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1842        .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1843        .dwattr $C$DW$171, DW_AT_decl_file("../sys_mailbox.h")
    1844        .dwattr $C$DW$171, DW_AT_decl_line(0xa3)
    1845        .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    1846$C$DW$172       .dwtag  DW_TAG_member
    1847        .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$11)
    1848        .dwattr $C$DW$172, DW_AT_name("NOTFULLSTATUSMB3")
    1849        .dwattr $C$DW$172, DW_AT_TI_symbol_name("NOTFULLSTATUSMB3")
    1850        .dwattr $C$DW$172, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1851        .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1852        .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1853        .dwattr $C$DW$172, DW_AT_decl_file("../sys_mailbox.h")
    1854        .dwattr $C$DW$172, DW_AT_decl_line(0xa4)
    1855        .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    1856$C$DW$173       .dwtag  DW_TAG_member
    1857        .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$11)
    1858        .dwattr $C$DW$173, DW_AT_name("NEWMSGSTATUSMB4")
    1859        .dwattr $C$DW$173, DW_AT_TI_symbol_name("NEWMSGSTATUSMB4")
    1860        .dwattr $C$DW$173, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1861        .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1862        .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1863        .dwattr $C$DW$173, DW_AT_decl_file("../sys_mailbox.h")
    1864        .dwattr $C$DW$173, DW_AT_decl_line(0xa5)
    1865        .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    1866$C$DW$174       .dwtag  DW_TAG_member
    1867        .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$11)
    1868        .dwattr $C$DW$174, DW_AT_name("NOTFULLSTATUSMB4")
    1869        .dwattr $C$DW$174, DW_AT_TI_symbol_name("NOTFULLSTATUSMB4")
    1870        .dwattr $C$DW$174, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1871        .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   36

    1872        .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1873        .dwattr $C$DW$174, DW_AT_decl_file("../sys_mailbox.h")
    1874        .dwattr $C$DW$174, DW_AT_decl_line(0xa6)
    1875        .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    1876$C$DW$175       .dwtag  DW_TAG_member
    1877        .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$11)
    1878        .dwattr $C$DW$175, DW_AT_name("NEWMSGSTATUSMB5")
    1879        .dwattr $C$DW$175, DW_AT_TI_symbol_name("NEWMSGSTATUSMB5")
    1880        .dwattr $C$DW$175, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1881        .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1882        .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1883        .dwattr $C$DW$175, DW_AT_decl_file("../sys_mailbox.h")
    1884        .dwattr $C$DW$175, DW_AT_decl_line(0xa7)
    1885        .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    1886$C$DW$176       .dwtag  DW_TAG_member
    1887        .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$11)
    1888        .dwattr $C$DW$176, DW_AT_name("NOTFULLSTATUSMB5")
    1889        .dwattr $C$DW$176, DW_AT_TI_symbol_name("NOTFULLSTATUSMB5")
    1890        .dwattr $C$DW$176, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1891        .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892        .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1893        .dwattr $C$DW$176, DW_AT_decl_file("../sys_mailbox.h")
    1894        .dwattr $C$DW$176, DW_AT_decl_line(0xa8)
    1895        .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    1896$C$DW$177       .dwtag  DW_TAG_member
    1897        .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$11)
    1898        .dwattr $C$DW$177, DW_AT_name("NEWMSGSTATUSMB6")
    1899        .dwattr $C$DW$177, DW_AT_TI_symbol_name("NEWMSGSTATUSMB6")
    1900        .dwattr $C$DW$177, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1901        .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902        .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1903        .dwattr $C$DW$177, DW_AT_decl_file("../sys_mailbox.h")
    1904        .dwattr $C$DW$177, DW_AT_decl_line(0xa9)
    1905        .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    1906$C$DW$178       .dwtag  DW_TAG_member
    1907        .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$11)
    1908        .dwattr $C$DW$178, DW_AT_name("NOTFULLSTATUSMB6")
    1909        .dwattr $C$DW$178, DW_AT_TI_symbol_name("NOTFULLSTATUSMB6")
    1910        .dwattr $C$DW$178, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1911        .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912        .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1913        .dwattr $C$DW$178, DW_AT_decl_file("../sys_mailbox.h")
    1914        .dwattr $C$DW$178, DW_AT_decl_line(0xaa)
    1915        .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    1916$C$DW$179       .dwtag  DW_TAG_member
    1917        .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$11)
    1918        .dwattr $C$DW$179, DW_AT_name("NEWMSGSTATUSMB7")
    1919        .dwattr $C$DW$179, DW_AT_TI_symbol_name("NEWMSGSTATUSMB7")
    1920        .dwattr $C$DW$179, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1921        .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1922        .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1923        .dwattr $C$DW$179, DW_AT_decl_file("../sys_mailbox.h")
    1924        .dwattr $C$DW$179, DW_AT_decl_line(0xab)
    1925        .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    1926$C$DW$180       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   37

    1927        .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$11)
    1928        .dwattr $C$DW$180, DW_AT_name("NOTFULLSTATUSMB7")
    1929        .dwattr $C$DW$180, DW_AT_TI_symbol_name("NOTFULLSTATUSMB7")
    1930        .dwattr $C$DW$180, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1931        .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1932        .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1933        .dwattr $C$DW$180, DW_AT_decl_file("../sys_mailbox.h")
    1934        .dwattr $C$DW$180, DW_AT_decl_line(0xac)
    1935        .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    1936$C$DW$181       .dwtag  DW_TAG_member
    1937        .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$11)
    1938        .dwattr $C$DW$181, DW_AT_name("rsvd")
    1939        .dwattr $C$DW$181, DW_AT_TI_symbol_name("rsvd")
    1940        .dwattr $C$DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1941        .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1942        .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1943        .dwattr $C$DW$181, DW_AT_decl_file("../sys_mailbox.h")
    1944        .dwattr $C$DW$181, DW_AT_decl_line(0xad)
    1945        .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    1946        .dwendtag $C$DW$T$26
    1947
    1948        .dwattr $C$DW$T$26, DW_AT_decl_file("../sys_mailbox.h")
    1949        .dwattr $C$DW$T$26, DW_AT_decl_line(0x9c)
    1950        .dwattr $C$DW$T$26, DW_AT_decl_column(0x14)
    1951$C$DW$T$234     .dwtag  DW_TAG_volatile_type
    1952        .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$26)
    1953
    1954$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1955        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1956$C$DW$182       .dwtag  DW_TAG_member
    1957        .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$11)
    1958        .dwattr $C$DW$182, DW_AT_name("NEWMSGSTATUSMB0")
    1959        .dwattr $C$DW$182, DW_AT_TI_symbol_name("NEWMSGSTATUSMB0")
    1960        .dwattr $C$DW$182, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1961        .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1962        .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1963        .dwattr $C$DW$182, DW_AT_decl_file("../sys_mailbox.h")
    1964        .dwattr $C$DW$182, DW_AT_decl_line(0xb4)
    1965        .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    1966$C$DW$183       .dwtag  DW_TAG_member
    1967        .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$11)
    1968        .dwattr $C$DW$183, DW_AT_name("NOTFULLSTATUSMB0")
    1969        .dwattr $C$DW$183, DW_AT_TI_symbol_name("NOTFULLSTATUSMB0")
    1970        .dwattr $C$DW$183, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1971        .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1972        .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1973        .dwattr $C$DW$183, DW_AT_decl_file("../sys_mailbox.h")
    1974        .dwattr $C$DW$183, DW_AT_decl_line(0xb5)
    1975        .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    1976$C$DW$184       .dwtag  DW_TAG_member
    1977        .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$11)
    1978        .dwattr $C$DW$184, DW_AT_name("NEWMSGSTATUSMB1")
    1979        .dwattr $C$DW$184, DW_AT_TI_symbol_name("NEWMSGSTATUSMB1")
    1980        .dwattr $C$DW$184, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1981        .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   38

    1982        .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1983        .dwattr $C$DW$184, DW_AT_decl_file("../sys_mailbox.h")
    1984        .dwattr $C$DW$184, DW_AT_decl_line(0xb6)
    1985        .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    1986$C$DW$185       .dwtag  DW_TAG_member
    1987        .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$11)
    1988        .dwattr $C$DW$185, DW_AT_name("NOTFULLSTATUSMB1")
    1989        .dwattr $C$DW$185, DW_AT_TI_symbol_name("NOTFULLSTATUSMB1")
    1990        .dwattr $C$DW$185, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1991        .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992        .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1993        .dwattr $C$DW$185, DW_AT_decl_file("../sys_mailbox.h")
    1994        .dwattr $C$DW$185, DW_AT_decl_line(0xb7)
    1995        .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    1996$C$DW$186       .dwtag  DW_TAG_member
    1997        .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$11)
    1998        .dwattr $C$DW$186, DW_AT_name("NEWMSGSTATUSMB2")
    1999        .dwattr $C$DW$186, DW_AT_TI_symbol_name("NEWMSGSTATUSMB2")
    2000        .dwattr $C$DW$186, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    2001        .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2002        .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2003        .dwattr $C$DW$186, DW_AT_decl_file("../sys_mailbox.h")
    2004        .dwattr $C$DW$186, DW_AT_decl_line(0xb8)
    2005        .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    2006$C$DW$187       .dwtag  DW_TAG_member
    2007        .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$11)
    2008        .dwattr $C$DW$187, DW_AT_name("NOTFULLSTATUSMB2")
    2009        .dwattr $C$DW$187, DW_AT_TI_symbol_name("NOTFULLSTATUSMB2")
    2010        .dwattr $C$DW$187, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    2011        .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012        .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2013        .dwattr $C$DW$187, DW_AT_decl_file("../sys_mailbox.h")
    2014        .dwattr $C$DW$187, DW_AT_decl_line(0xb9)
    2015        .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    2016$C$DW$188       .dwtag  DW_TAG_member
    2017        .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$11)
    2018        .dwattr $C$DW$188, DW_AT_name("NEWMSGSTATUSMB3")
    2019        .dwattr $C$DW$188, DW_AT_TI_symbol_name("NEWMSGSTATUSMB3")
    2020        .dwattr $C$DW$188, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    2021        .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022        .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2023        .dwattr $C$DW$188, DW_AT_decl_file("../sys_mailbox.h")
    2024        .dwattr $C$DW$188, DW_AT_decl_line(0xba)
    2025        .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    2026$C$DW$189       .dwtag  DW_TAG_member
    2027        .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$11)
    2028        .dwattr $C$DW$189, DW_AT_name("NOTFULLSTATUSMB3")
    2029        .dwattr $C$DW$189, DW_AT_TI_symbol_name("NOTFULLSTATUSMB3")
    2030        .dwattr $C$DW$189, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    2031        .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032        .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2033        .dwattr $C$DW$189, DW_AT_decl_file("../sys_mailbox.h")
    2034        .dwattr $C$DW$189, DW_AT_decl_line(0xbb)
    2035        .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    2036$C$DW$190       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   39

    2037        .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$11)
    2038        .dwattr $C$DW$190, DW_AT_name("NEWMSGSTATUSMB4")
    2039        .dwattr $C$DW$190, DW_AT_TI_symbol_name("NEWMSGSTATUSMB4")
    2040        .dwattr $C$DW$190, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    2041        .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2042        .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2043        .dwattr $C$DW$190, DW_AT_decl_file("../sys_mailbox.h")
    2044        .dwattr $C$DW$190, DW_AT_decl_line(0xbc)
    2045        .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    2046$C$DW$191       .dwtag  DW_TAG_member
    2047        .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$11)
    2048        .dwattr $C$DW$191, DW_AT_name("NOTFULLSTATUSMB4")
    2049        .dwattr $C$DW$191, DW_AT_TI_symbol_name("NOTFULLSTATUSMB4")
    2050        .dwattr $C$DW$191, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    2051        .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2052        .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2053        .dwattr $C$DW$191, DW_AT_decl_file("../sys_mailbox.h")
    2054        .dwattr $C$DW$191, DW_AT_decl_line(0xbd)
    2055        .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    2056$C$DW$192       .dwtag  DW_TAG_member
    2057        .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$11)
    2058        .dwattr $C$DW$192, DW_AT_name("NEWMSGSTATUSMB5")
    2059        .dwattr $C$DW$192, DW_AT_TI_symbol_name("NEWMSGSTATUSMB5")
    2060        .dwattr $C$DW$192, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    2061        .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2062        .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2063        .dwattr $C$DW$192, DW_AT_decl_file("../sys_mailbox.h")
    2064        .dwattr $C$DW$192, DW_AT_decl_line(0xbe)
    2065        .dwattr $C$DW$192, DW_AT_decl_column(0x0e)
    2066$C$DW$193       .dwtag  DW_TAG_member
    2067        .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$11)
    2068        .dwattr $C$DW$193, DW_AT_name("NOTFULLSTATUSMB5")
    2069        .dwattr $C$DW$193, DW_AT_TI_symbol_name("NOTFULLSTATUSMB5")
    2070        .dwattr $C$DW$193, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    2071        .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2072        .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2073        .dwattr $C$DW$193, DW_AT_decl_file("../sys_mailbox.h")
    2074        .dwattr $C$DW$193, DW_AT_decl_line(0xbf)
    2075        .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    2076$C$DW$194       .dwtag  DW_TAG_member
    2077        .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$11)
    2078        .dwattr $C$DW$194, DW_AT_name("NEWMSGSTATUSMB6")
    2079        .dwattr $C$DW$194, DW_AT_TI_symbol_name("NEWMSGSTATUSMB6")
    2080        .dwattr $C$DW$194, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    2081        .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082        .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2083        .dwattr $C$DW$194, DW_AT_decl_file("../sys_mailbox.h")
    2084        .dwattr $C$DW$194, DW_AT_decl_line(0xc0)
    2085        .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    2086$C$DW$195       .dwtag  DW_TAG_member
    2087        .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$11)
    2088        .dwattr $C$DW$195, DW_AT_name("NOTFULLSTATUSMB6")
    2089        .dwattr $C$DW$195, DW_AT_TI_symbol_name("NOTFULLSTATUSMB6")
    2090        .dwattr $C$DW$195, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    2091        .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   40

    2092        .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2093        .dwattr $C$DW$195, DW_AT_decl_file("../sys_mailbox.h")
    2094        .dwattr $C$DW$195, DW_AT_decl_line(0xc1)
    2095        .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    2096$C$DW$196       .dwtag  DW_TAG_member
    2097        .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$11)
    2098        .dwattr $C$DW$196, DW_AT_name("NEWMSGSTATUSMB7")
    2099        .dwattr $C$DW$196, DW_AT_TI_symbol_name("NEWMSGSTATUSMB7")
    2100        .dwattr $C$DW$196, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    2101        .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2102        .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2103        .dwattr $C$DW$196, DW_AT_decl_file("../sys_mailbox.h")
    2104        .dwattr $C$DW$196, DW_AT_decl_line(0xc2)
    2105        .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    2106$C$DW$197       .dwtag  DW_TAG_member
    2107        .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$11)
    2108        .dwattr $C$DW$197, DW_AT_name("NOTFULLSTATUSMB7")
    2109        .dwattr $C$DW$197, DW_AT_TI_symbol_name("NOTFULLSTATUSMB7")
    2110        .dwattr $C$DW$197, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    2111        .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2112        .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2113        .dwattr $C$DW$197, DW_AT_decl_file("../sys_mailbox.h")
    2114        .dwattr $C$DW$197, DW_AT_decl_line(0xc3)
    2115        .dwattr $C$DW$197, DW_AT_decl_column(0x0e)
    2116$C$DW$198       .dwtag  DW_TAG_member
    2117        .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$11)
    2118        .dwattr $C$DW$198, DW_AT_name("rsvd")
    2119        .dwattr $C$DW$198, DW_AT_TI_symbol_name("rsvd")
    2120        .dwattr $C$DW$198, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2121        .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2122        .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2123        .dwattr $C$DW$198, DW_AT_decl_file("../sys_mailbox.h")
    2124        .dwattr $C$DW$198, DW_AT_decl_line(0xc4)
    2125        .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    2126        .dwendtag $C$DW$T$27
    2127
    2128        .dwattr $C$DW$T$27, DW_AT_decl_file("../sys_mailbox.h")
    2129        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb3)
    2130        .dwattr $C$DW$T$27, DW_AT_decl_column(0x14)
    2131$C$DW$T$236     .dwtag  DW_TAG_volatile_type
    2132        .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$27)
    2133
    2134$C$DW$T$28      .dwtag  DW_TAG_structure_type
    2135        .dwattr $C$DW$T$28, DW_AT_byte_size(0x10)
    2136$C$DW$199       .dwtag  DW_TAG_member
    2137        .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$231)
    2138        .dwattr $C$DW$199, DW_AT_name("$P$T5")
    2139        .dwattr $C$DW$199, DW_AT_TI_symbol_name("$P$T5")
    2140        .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2141        .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2142        .dwattr $C$DW$199, DW_AT_decl_file("../sys_mailbox.h")
    2143        .dwattr $C$DW$199, DW_AT_decl_line(0x6b)
    2144        .dwattr $C$DW$199, DW_AT_decl_column(0x03)
    2145$C$DW$200       .dwtag  DW_TAG_member
    2146        .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$233)
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   41

    2147        .dwattr $C$DW$200, DW_AT_name("$P$T6")
    2148        .dwattr $C$DW$200, DW_AT_TI_symbol_name("$P$T6")
    2149        .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2150        .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2151        .dwattr $C$DW$200, DW_AT_decl_file("../sys_mailbox.h")
    2152        .dwattr $C$DW$200, DW_AT_decl_line(0x82)
    2153        .dwattr $C$DW$200, DW_AT_decl_column(0x03)
    2154$C$DW$201       .dwtag  DW_TAG_member
    2155        .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$235)
    2156        .dwattr $C$DW$201, DW_AT_name("$P$T7")
    2157        .dwattr $C$DW$201, DW_AT_TI_symbol_name("$P$T7")
    2158        .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2159        .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2160        .dwattr $C$DW$201, DW_AT_decl_file("../sys_mailbox.h")
    2161        .dwattr $C$DW$201, DW_AT_decl_line(0x99)
    2162        .dwattr $C$DW$201, DW_AT_decl_column(0x03)
    2163$C$DW$202       .dwtag  DW_TAG_member
    2164        .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$237)
    2165        .dwattr $C$DW$202, DW_AT_name("$P$T8")
    2166        .dwattr $C$DW$202, DW_AT_TI_symbol_name("$P$T8")
    2167        .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2168        .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2169        .dwattr $C$DW$202, DW_AT_decl_file("../sys_mailbox.h")
    2170        .dwattr $C$DW$202, DW_AT_decl_line(0xb0)
    2171        .dwattr $C$DW$202, DW_AT_decl_column(0x03)
    2172        .dwendtag $C$DW$T$28
    2173
    2174        .dwattr $C$DW$T$28, DW_AT_decl_file("../sys_mailbox.h")
    2175        .dwattr $C$DW$T$28, DW_AT_decl_line(0x6a)
    2176        .dwattr $C$DW$T$28, DW_AT_decl_column(0x12)
    2177$C$DW$T$33      .dwtag  DW_TAG_volatile_type
    2178        .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$28)
    2179
    2180$C$DW$T$34      .dwtag  DW_TAG_array_type
    2181        .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2182        .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2183        .dwattr $C$DW$T$34, DW_AT_byte_size(0x40)
    2184$C$DW$203       .dwtag  DW_TAG_subrange_type
    2185        .dwattr $C$DW$203, DW_AT_upper_bound(0x03)
    2186        .dwendtag $C$DW$T$34
    2187
    2188
    2189$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2190        .dwattr $C$DW$T$35, DW_AT_byte_size(0x140)
    2191$C$DW$204       .dwtag  DW_TAG_member
    2192        .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$217)
    2193        .dwattr $C$DW$204, DW_AT_name("$P$T0")
    2194        .dwattr $C$DW$204, DW_AT_TI_symbol_name("$P$T0")
    2195        .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2196        .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2197        .dwattr $C$DW$204, DW_AT_decl_file("../sys_mailbox.h")
    2198        .dwattr $C$DW$204, DW_AT_decl_line(0x29)
    2199        .dwattr $C$DW$204, DW_AT_decl_column(0x02)
    2200$C$DW$205       .dwtag  DW_TAG_member
    2201        .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$30)
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   42

    2202        .dwattr $C$DW$205, DW_AT_name("rsvd4")
    2203        .dwattr $C$DW$205, DW_AT_TI_symbol_name("rsvd4")
    2204        .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2205        .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2206        .dwattr $C$DW$205, DW_AT_decl_file("../sys_mailbox.h")
    2207        .dwattr $C$DW$205, DW_AT_decl_line(0x37)
    2208        .dwattr $C$DW$205, DW_AT_decl_column(0x0b)
    2209$C$DW$206       .dwtag  DW_TAG_member
    2210        .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$219)
    2211        .dwattr $C$DW$206, DW_AT_name("$P$T1")
    2212        .dwattr $C$DW$206, DW_AT_TI_symbol_name("$P$T1")
    2213        .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2214        .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2215        .dwattr $C$DW$206, DW_AT_decl_file("../sys_mailbox.h")
    2216        .dwattr $C$DW$206, DW_AT_decl_line(0x3a)
    2217        .dwattr $C$DW$206, DW_AT_decl_column(0x02)
    2218$C$DW$207       .dwtag  DW_TAG_member
    2219        .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$31)
    2220        .dwattr $C$DW$207, DW_AT_name("rsvd14")
    2221        .dwattr $C$DW$207, DW_AT_TI_symbol_name("rsvd14")
    2222        .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2223        .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2224        .dwattr $C$DW$207, DW_AT_decl_file("../sys_mailbox.h")
    2225        .dwattr $C$DW$207, DW_AT_decl_line(0x45)
    2226        .dwattr $C$DW$207, DW_AT_decl_column(0x0b)
    2227$C$DW$208       .dwtag  DW_TAG_member
    2228        .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$223)
    2229        .dwattr $C$DW$208, DW_AT_name("$P$T2")
    2230        .dwattr $C$DW$208, DW_AT_TI_symbol_name("$P$T2")
    2231        .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2232        .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2233        .dwattr $C$DW$208, DW_AT_decl_file("../sys_mailbox.h")
    2234        .dwattr $C$DW$208, DW_AT_decl_line(0x48)
    2235        .dwattr $C$DW$208, DW_AT_decl_column(0x02)
    2236$C$DW$209       .dwtag  DW_TAG_member
    2237        .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$32)
    2238        .dwattr $C$DW$209, DW_AT_name("rsvd60")
    2239        .dwattr $C$DW$209, DW_AT_TI_symbol_name("rsvd60")
    2240        .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2241        .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2242        .dwattr $C$DW$209, DW_AT_decl_file("../sys_mailbox.h")
    2243        .dwattr $C$DW$209, DW_AT_decl_line(0x50)
    2244        .dwattr $C$DW$209, DW_AT_decl_column(0x0b)
    2245$C$DW$210       .dwtag  DW_TAG_member
    2246        .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$226)
    2247        .dwattr $C$DW$210, DW_AT_name("$P$T3")
    2248        .dwattr $C$DW$210, DW_AT_TI_symbol_name("$P$T3")
    2249        .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2250        .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2251        .dwattr $C$DW$210, DW_AT_decl_file("../sys_mailbox.h")
    2252        .dwattr $C$DW$210, DW_AT_decl_line(0x53)
    2253        .dwattr $C$DW$210, DW_AT_decl_column(0x02)
    2254$C$DW$211       .dwtag  DW_TAG_member
    2255        .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$32)
    2256        .dwattr $C$DW$211, DW_AT_name("rsvdA0")
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   43

    2257        .dwattr $C$DW$211, DW_AT_TI_symbol_name("rsvdA0")
    2258        .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2259        .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2260        .dwattr $C$DW$211, DW_AT_decl_file("../sys_mailbox.h")
    2261        .dwattr $C$DW$211, DW_AT_decl_line(0x5c)
    2262        .dwattr $C$DW$211, DW_AT_decl_column(0x0b)
    2263$C$DW$212       .dwtag  DW_TAG_member
    2264        .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$229)
    2265        .dwattr $C$DW$212, DW_AT_name("$P$T4")
    2266        .dwattr $C$DW$212, DW_AT_TI_symbol_name("$P$T4")
    2267        .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2268        .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2269        .dwattr $C$DW$212, DW_AT_decl_file("../sys_mailbox.h")
    2270        .dwattr $C$DW$212, DW_AT_decl_line(0x5f)
    2271        .dwattr $C$DW$212, DW_AT_decl_column(0x02)
    2272$C$DW$213       .dwtag  DW_TAG_member
    2273        .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$32)
    2274        .dwattr $C$DW$213, DW_AT_name("rsvdE0")
    2275        .dwattr $C$DW$213, DW_AT_TI_symbol_name("rsvdE0")
    2276        .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2277        .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2278        .dwattr $C$DW$213, DW_AT_decl_file("../sys_mailbox.h")
    2279        .dwattr $C$DW$213, DW_AT_decl_line(0x68)
    2280        .dwattr $C$DW$213, DW_AT_decl_column(0x0b)
    2281$C$DW$214       .dwtag  DW_TAG_member
    2282        .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$34)
    2283        .dwattr $C$DW$214, DW_AT_name("IRQ")
    2284        .dwattr $C$DW$214, DW_AT_TI_symbol_name("IRQ")
    2285        .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2286        .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2287        .dwattr $C$DW$214, DW_AT_decl_file("../sys_mailbox.h")
    2288        .dwattr $C$DW$214, DW_AT_decl_line(0xc7)
    2289        .dwattr $C$DW$214, DW_AT_decl_column(0x04)
    2290        .dwendtag $C$DW$T$35
    2291
    2292        .dwattr $C$DW$T$35, DW_AT_decl_file("../sys_mailbox.h")
    2293        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2294        .dwattr $C$DW$T$35, DW_AT_decl_column(0x0f)
    2295$C$DW$T$597     .dwtag  DW_TAG_typedef, DW_AT_name("sysMailbox")
    2296        .dwattr $C$DW$T$597, DW_AT_type(*$C$DW$T$35)
    2297        .dwattr $C$DW$T$597, DW_AT_language(DW_LANG_C)
    2298        .dwattr $C$DW$T$597, DW_AT_decl_file("../sys_mailbox.h")
    2299        .dwattr $C$DW$T$597, DW_AT_decl_line(0xc9)
    2300        .dwattr $C$DW$T$597, DW_AT_decl_column(0x03)
    2301$C$DW$T$598     .dwtag  DW_TAG_volatile_type
    2302        .dwattr $C$DW$T$598, DW_AT_type(*$C$DW$T$597)
    2303
    2304$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2305        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2306$C$DW$215       .dwtag  DW_TAG_member
    2307        .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$11)
    2308        .dwattr $C$DW$215, DW_AT_name("REV_MINOR")
    2309        .dwattr $C$DW$215, DW_AT_TI_symbol_name("REV_MINOR")
    2310        .dwattr $C$DW$215, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    2311        .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   44

    2312        .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2313        .dwattr $C$DW$215, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2314        .dwattr $C$DW$215, DW_AT_decl_line(0x0a)
    2315        .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    2316$C$DW$216       .dwtag  DW_TAG_member
    2317        .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$11)
    2318        .dwattr $C$DW$216, DW_AT_name("REV_CUSTOM")
    2319        .dwattr $C$DW$216, DW_AT_TI_symbol_name("REV_CUSTOM")
    2320        .dwattr $C$DW$216, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    2321        .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322        .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2323        .dwattr $C$DW$216, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2324        .dwattr $C$DW$216, DW_AT_decl_line(0x0b)
    2325        .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    2326$C$DW$217       .dwtag  DW_TAG_member
    2327        .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$11)
    2328        .dwattr $C$DW$217, DW_AT_name("REV_MAJOR")
    2329        .dwattr $C$DW$217, DW_AT_TI_symbol_name("REV_MAJOR")
    2330        .dwattr $C$DW$217, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    2331        .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332        .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2333        .dwattr $C$DW$217, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2334        .dwattr $C$DW$217, DW_AT_decl_line(0x0c)
    2335        .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    2336$C$DW$218       .dwtag  DW_TAG_member
    2337        .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$11)
    2338        .dwattr $C$DW$218, DW_AT_name("REV_RTL")
    2339        .dwattr $C$DW$218, DW_AT_TI_symbol_name("REV_RTL")
    2340        .dwattr $C$DW$218, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    2341        .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2342        .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2343        .dwattr $C$DW$218, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2344        .dwattr $C$DW$218, DW_AT_decl_line(0x0d)
    2345        .dwattr $C$DW$218, DW_AT_decl_column(0x0d)
    2346$C$DW$219       .dwtag  DW_TAG_member
    2347        .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$11)
    2348        .dwattr $C$DW$219, DW_AT_name("REV_MODULE")
    2349        .dwattr $C$DW$219, DW_AT_TI_symbol_name("REV_MODULE")
    2350        .dwattr $C$DW$219, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    2351        .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2352        .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2353        .dwattr $C$DW$219, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2354        .dwattr $C$DW$219, DW_AT_decl_line(0x0e)
    2355        .dwattr $C$DW$219, DW_AT_decl_column(0x0d)
    2356$C$DW$220       .dwtag  DW_TAG_member
    2357        .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$11)
    2358        .dwattr $C$DW$220, DW_AT_name("rsvd28")
    2359        .dwattr $C$DW$220, DW_AT_TI_symbol_name("rsvd28")
    2360        .dwattr $C$DW$220, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2361        .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2362        .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2363        .dwattr $C$DW$220, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2364        .dwattr $C$DW$220, DW_AT_decl_line(0x0f)
    2365        .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    2366$C$DW$221       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   45

    2367        .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$11)
    2368        .dwattr $C$DW$221, DW_AT_name("REV_SCHEME")
    2369        .dwattr $C$DW$221, DW_AT_TI_symbol_name("REV_SCHEME")
    2370        .dwattr $C$DW$221, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2371        .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372        .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2373        .dwattr $C$DW$221, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2374        .dwattr $C$DW$221, DW_AT_decl_line(0x10)
    2375        .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    2376        .dwendtag $C$DW$T$36
    2377
    2378        .dwattr $C$DW$T$36, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2379        .dwattr $C$DW$T$36, DW_AT_decl_line(0x09)
    2380        .dwattr $C$DW$T$36, DW_AT_decl_column(0x12)
    2381$C$DW$T$238     .dwtag  DW_TAG_volatile_type
    2382        .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$36)
    2383
    2384$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2385        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2386$C$DW$222       .dwtag  DW_TAG_member
    2387        .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$11)
    2388        .dwattr $C$DW$222, DW_AT_name("rsvd0")
    2389        .dwattr $C$DW$222, DW_AT_TI_symbol_name("rsvd0")
    2390        .dwattr $C$DW$222, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    2391        .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2392        .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2393        .dwattr $C$DW$222, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2394        .dwattr $C$DW$222, DW_AT_decl_line(0x1a)
    2395        .dwattr $C$DW$222, DW_AT_decl_column(0x0d)
    2396$C$DW$223       .dwtag  DW_TAG_member
    2397        .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$11)
    2398        .dwattr $C$DW$223, DW_AT_name("NEST_MODE")
    2399        .dwattr $C$DW$223, DW_AT_TI_symbol_name("NEST_MODE")
    2400        .dwattr $C$DW$223, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    2401        .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2402        .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2403        .dwattr $C$DW$223, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2404        .dwattr $C$DW$223, DW_AT_decl_line(0x1b)
    2405        .dwattr $C$DW$223, DW_AT_decl_column(0x0d)
    2406$C$DW$224       .dwtag  DW_TAG_member
    2407        .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$11)
    2408        .dwattr $C$DW$224, DW_AT_name("rsvd4")
    2409        .dwattr $C$DW$224, DW_AT_TI_symbol_name("rsvd4")
    2410        .dwattr $C$DW$224, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    2411        .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2412        .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2413        .dwattr $C$DW$224, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2414        .dwattr $C$DW$224, DW_AT_decl_line(0x1c)
    2415        .dwattr $C$DW$224, DW_AT_decl_column(0x0d)
    2416        .dwendtag $C$DW$T$37
    2417
    2418        .dwattr $C$DW$T$37, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2419        .dwattr $C$DW$T$37, DW_AT_decl_line(0x19)
    2420        .dwattr $C$DW$T$37, DW_AT_decl_column(0x12)
    2421$C$DW$T$240     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   46

    2422        .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$37)
    2423
    2424$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2425        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2426$C$DW$225       .dwtag  DW_TAG_member
    2427        .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$11)
    2428        .dwattr $C$DW$225, DW_AT_name("EN_HINT_ANY")
    2429        .dwattr $C$DW$225, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2430        .dwattr $C$DW$225, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2431        .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432        .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2433        .dwattr $C$DW$225, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2434        .dwattr $C$DW$225, DW_AT_decl_line(0x29)
    2435        .dwattr $C$DW$225, DW_AT_decl_column(0x0d)
    2436$C$DW$226       .dwtag  DW_TAG_member
    2437        .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$11)
    2438        .dwattr $C$DW$226, DW_AT_name("rsvd1")
    2439        .dwattr $C$DW$226, DW_AT_TI_symbol_name("rsvd1")
    2440        .dwattr $C$DW$226, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2441        .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442        .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2443        .dwattr $C$DW$226, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2444        .dwattr $C$DW$226, DW_AT_decl_line(0x2a)
    2445        .dwattr $C$DW$226, DW_AT_decl_column(0x0d)
    2446        .dwendtag $C$DW$T$38
    2447
    2448        .dwattr $C$DW$T$38, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2449        .dwattr $C$DW$T$38, DW_AT_decl_line(0x28)
    2450        .dwattr $C$DW$T$38, DW_AT_decl_column(0x12)
    2451$C$DW$T$242     .dwtag  DW_TAG_volatile_type
    2452        .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$38)
    2453
    2454$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2455        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2456$C$DW$227       .dwtag  DW_TAG_member
    2457        .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$11)
    2458        .dwattr $C$DW$227, DW_AT_name("GLB_NEST_LEVEL")
    2459        .dwattr $C$DW$227, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2460        .dwattr $C$DW$227, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2461        .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2462        .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2463        .dwattr $C$DW$227, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2464        .dwattr $C$DW$227, DW_AT_decl_line(0x37)
    2465        .dwattr $C$DW$227, DW_AT_decl_column(0x0d)
    2466$C$DW$228       .dwtag  DW_TAG_member
    2467        .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$11)
    2468        .dwattr $C$DW$228, DW_AT_name("rsvd9")
    2469        .dwattr $C$DW$228, DW_AT_TI_symbol_name("rsvd9")
    2470        .dwattr $C$DW$228, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2471        .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472        .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2473        .dwattr $C$DW$228, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2474        .dwattr $C$DW$228, DW_AT_decl_line(0x38)
    2475        .dwattr $C$DW$228, DW_AT_decl_column(0x0d)
    2476$C$DW$229       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   47

    2477        .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$11)
    2478        .dwattr $C$DW$229, DW_AT_name("AUTO_OVERRIDE")
    2479        .dwattr $C$DW$229, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2480        .dwattr $C$DW$229, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2481        .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2482        .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2483        .dwattr $C$DW$229, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2484        .dwattr $C$DW$229, DW_AT_decl_line(0x39)
    2485        .dwattr $C$DW$229, DW_AT_decl_column(0x0d)
    2486        .dwendtag $C$DW$T$39
    2487
    2488        .dwattr $C$DW$T$39, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2489        .dwattr $C$DW$T$39, DW_AT_decl_line(0x36)
    2490        .dwattr $C$DW$T$39, DW_AT_decl_column(0x12)
    2491$C$DW$T$244     .dwtag  DW_TAG_volatile_type
    2492        .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$39)
    2493
    2494$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2495        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2496$C$DW$230       .dwtag  DW_TAG_member
    2497        .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$11)
    2498        .dwattr $C$DW$230, DW_AT_name("STS_SET_IDX")
    2499        .dwattr $C$DW$230, DW_AT_TI_symbol_name("STS_SET_IDX")
    2500        .dwattr $C$DW$230, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2501        .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2502        .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2503        .dwattr $C$DW$230, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2504        .dwattr $C$DW$230, DW_AT_decl_line(0x43)
    2505        .dwattr $C$DW$230, DW_AT_decl_column(0x0d)
    2506$C$DW$231       .dwtag  DW_TAG_member
    2507        .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$11)
    2508        .dwattr $C$DW$231, DW_AT_name("rsvd10")
    2509        .dwattr $C$DW$231, DW_AT_TI_symbol_name("rsvd10")
    2510        .dwattr $C$DW$231, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2511        .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2512        .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2513        .dwattr $C$DW$231, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2514        .dwattr $C$DW$231, DW_AT_decl_line(0x44)
    2515        .dwattr $C$DW$231, DW_AT_decl_column(0x0d)
    2516        .dwendtag $C$DW$T$40
    2517
    2518        .dwattr $C$DW$T$40, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2519        .dwattr $C$DW$T$40, DW_AT_decl_line(0x42)
    2520        .dwattr $C$DW$T$40, DW_AT_decl_column(0x12)
    2521$C$DW$T$246     .dwtag  DW_TAG_volatile_type
    2522        .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$40)
    2523
    2524$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2525        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2526$C$DW$232       .dwtag  DW_TAG_member
    2527        .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$11)
    2528        .dwattr $C$DW$232, DW_AT_name("STS_CLR_IDX")
    2529        .dwattr $C$DW$232, DW_AT_TI_symbol_name("STS_CLR_IDX")
    2530        .dwattr $C$DW$232, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2531        .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.2 Thu Jan 28 12:38:40 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   48

    2532        .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2533        .dwattr $C$DW$232, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2534        .dwattr $C$DW$232, DW_AT_decl_line(0x4e)
    2535        .dwattr $C$DW$232, DW_AT_decl_column(0x0d)
    2536$C$DW$233       .dwtag  DW_TAG_member
    2537        .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$11)
    2538        .dwattr $C$DW$233, DW_AT_name("rsvd10")
    2539        .dwattr $C$DW$233, DW_AT_TI_symbol_name("rsvd10")
    2540        .dwattr $C$DW$233, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2541        .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2542        .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2543        .dwattr $C$DW$233, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2544        .dwattr $C$DW$233, DW_AT_decl_line(0x4f)
    2545        .dwattr $C$DW$233, DW_AT_decl_column(0x0d)
    2546        .dwendtag $C$DW$T$41
    2547
    2548        .dwattr $C$DW$T$41, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2549        .dwattr $C$DW$T$41, DW_AT_decl_line(0x4d)
    2550        .dwattr $C$DW$T$41, DW_AT_decl_column(0x12)
    2551$C$DW$T$248     .dwtag  DW_TAG_volatile_type
    2552        .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$41)
    2553
    2554$C$DW$T$42      .dwtag  DW_TAG_structure_type
    2555        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    2556$C$DW$234       .dwtag  DW_TAG_member
    2557        .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$11)
    2558        .dwattr $C$DW$234, DW_AT_name("EN_SET_IDX")
