PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.2 *
       3;* Date/Time created: Wed Sep  7 12:11:05 2016                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --diag_wrap=off --endian=little --hll_source=on --object_format=elf 
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("../mcp3202.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.2 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/bwilcutt/workspace/onyxx-drivers/PRU_workspace/PRU_SPI
      12        .global __PRU_CREG_DDR
      13        .global __PRU_CREG_PRU_INTC
      14        .global __PRU_CREG_PRU_CFG
      15        .global __PRU_CREG_PRU_SHAREDMEM
      16
      17$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
      18        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")
      19        .dwattr $C$DW$1, DW_AT_declaration
      20        .dwattr $C$DW$1, DW_AT_external
      21

    1655 00000278 000000240100EE          LDI       r14, 0x0100           ; [ALU_PRU] |348| 
    1656;* --------------------------------------------------------------------------*
    1657;*   BEGIN LOOP ||$C$L28||
    1658;*
    1659;*   Loop source line                : 348
    1660;*   Loop closing brace source line  : 352
    1661;*   Known Minimum Trip Count        : 1
    1662;*   Known Maximum Trip Count        : 4294967295
    1663;*   Known Max Trip Count Factor     : 1
    1664;* --------------------------------------------------------------------------*
    1665 0000027c                 ||$C$L28||:    
    1666        .dwpsn  file "../mcp3202.c",line 350,column 3,is_stmt,isa 0
    1667 0000027c 000000F1002280          LBBO      &r0, r2, 0, 4         ; [ALU_PRU] |350| i
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   33

    1668 00000280 00000010D1D1E1          MOV       r1, r17.w2            ; [ALU_PRU] |350| 
    1669 00000284 0000000902E0E0          LSL       r0, r0, 0x02          ; [ALU_PRU] |350| 
    1670 00000288 00000000F0E0E0          ADD       r0, r0, r16           ; [ALU_PRU] |350| 
    1671 0000028c 000000E1000001          SBBO      &r1.b0, r0, 0, 1      ; [ALU_PRU] |350| 
    1672 00000290 0000000B08D1E1          LSR       r1, r17.w2, 0x08      ; [ALU_PRU] |350| 
    1673 00000294 000000E1010001          SBBO      &r1.b0, r0, 1, 1      ; [ALU_PRU] |350| 
    1674        .dwpsn  file "../mcp3202.c",line 351,column 3,is_stmt,isa 0
    1675 00000298 000000109191E1          MOV       r1, r17.w0            ; [ALU_PRU] |351| 
    1676 0000029c 000000F1002280          LBBO      &r0, r2, 0, 4         ; [ALU_PRU] |351| i
    1677 000002a0 0000000902E0E0          LSL       r0, r0, 0x02          ; [ALU_PRU] |351| 
    1678 000002a4 00000000EFE0E0          ADD       r0, r0, r15           ; [ALU_PRU] |351| 
    1679 000002a8 000000E1000001          SBBO      &r1.b0, r0, 0, 1      ; [ALU_PRU] |351| 
    1680 000002ac 0000000B0891E1          LSR       r1, r17.w0, 0x08      ; [ALU_PRU] |351| 
    1681 000002b0 000000E1010001          SBBO      &r1.b0, r0, 1, 1      ; [ALU_PRU] |351| 
    1682        .dwpsn  file "../mcp3202.c",line 348,column 30,is_stmt,isa 0
    1683 000002b4 000000F1002280          LBBO      &r0, r2, 0, 4         ; [ALU_PRU] |348| i
    1684 000002b8 0000000101E0E0          ADD       r0, r0, 0x01          ; [ALU_PRU] |348| 
    1685 000002bc 000000E1002280          SBBO      &r0, r2, 0, 4         ; [ALU_PRU] |348| i
    1686        .dwpsn  file "../mcp3202.c",line 348,column 14,is_stmt,isa 0
    1687 000002c0 00000015806060          XOR       r0.b3, r0.b3, 0x80    ; [ALU_PRU] |348| 
    1688 000002c4 00000010EEEEE1          MOV       r1, r14               ; [ALU_PRU] |348| 
    1689 000002c8 00000015806161          XOR       r1.b3, r1.b3, 0x80    ; [ALU_PRU] |348| 
    1690 000002cc 0000004EE0E1EC          QBLT      ||$C$L28||, r1, r0    ; [ALU_PRU] |348| 
    1691;* --------------------------------------------------------------------------*
    1692        .dwpsn  file "../mcp3202.c",line 353,column 1,is_stmt,isa 0
    1693;* --------------------------------------------------------------------------*
    1694 000002d0                 ||$C$L29||:    
    1695 000002d0 0000000104E2E2          ADD       r2, r2, 0x04          ; [ALU_PRU] 
    1696        .dwcfi  cfa_offset, 0
    1697$C$DW$122       .dwtag  DW_TAG_TI_branch
    1698        .dwattr $C$DW$122, DW_AT_low_pc(0x00)
    1699        .dwattr $C$DW$122, DW_AT_TI_return
    1700 000002d4 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
    1701        .dwattr $C$DW$120, DW_AT_TI_end_file("../mcp3202.c")
    1702        .dwattr $C$DW$120, DW_AT_TI_end_line(0x161)
    1703        .dwattr $C$DW$120, DW_AT_TI_end_column(0x01)
    1704        .dwendentry
    1705        .dwendtag $C$DW$120
    1706
    1707;*****************************************************************************
    1708;* UNDEFINED EXTERNAL REFERENCES                                             *
    1709;*****************************************************************************
    1710        .global ||Is_RxDataReady||
    1711        .global ||SPI_ChannelSet||
    1712        .global ||SPI_ClkConfig||
    1713        .global ||SPI_CSPolaritySet||
    1714        .global ||SPI_CSSet||
    1715        .global ||SPI_DataPinDirection||
    1716        .global ||SPI_MasterModeEnable||
    1717        .global ||SPI_MasterModeSet||
    1718        .global ||SPI_ReceiveData||
    1719        .global ||SPI_Reset||
    1720        .global ||SPI_RxFIFODisable||
    1721        .global ||SPI_StartBitDisable||
    1722        .global ||SPI_StartBitEnable||
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   34

    1723        .global ||SPI_StartBitPolaritySet||
    1724        .global ||SPI_TransmitData||
    1725        .global ||SPI_TxFIFODisable||
    1726        .global ||SPI_WordCountSet||
    1727        .global ||SPI_WordLengthSet||
    1728
    1729;******************************************************************************
    1730;* TYPE INFORMATION                                                           *
    1731;******************************************************************************
    1732
    1733$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1734        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1735$C$DW$123       .dwtag  DW_TAG_member
    1736        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1737        .dwattr $C$DW$123, DW_AT_name("REV_MINOR")
    1738        .dwattr $C$DW$123, DW_AT_TI_symbol_name("REV_MINOR")
    1739        .dwattr $C$DW$123, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    1740        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1741        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1742        .dwattr $C$DW$123, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1743        .dwattr $C$DW$123, DW_AT_decl_line(0x0a)
    1744        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1745$C$DW$124       .dwtag  DW_TAG_member
    1746        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1747        .dwattr $C$DW$124, DW_AT_name("REV_CUSTOM")
    1748        .dwattr $C$DW$124, DW_AT_TI_symbol_name("REV_CUSTOM")
    1749        .dwattr $C$DW$124, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    1750        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1751        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1752        .dwattr $C$DW$124, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1753        .dwattr $C$DW$124, DW_AT_decl_line(0x0b)
    1754        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1755$C$DW$125       .dwtag  DW_TAG_member
    1756        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1757        .dwattr $C$DW$125, DW_AT_name("REV_MAJOR")
    1758        .dwattr $C$DW$125, DW_AT_TI_symbol_name("REV_MAJOR")
    1759        .dwattr $C$DW$125, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    1760        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1761        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1762        .dwattr $C$DW$125, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1763        .dwattr $C$DW$125, DW_AT_decl_line(0x0c)
    1764        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1765$C$DW$126       .dwtag  DW_TAG_member
    1766        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1767        .dwattr $C$DW$126, DW_AT_name("REV_RTL")
    1768        .dwattr $C$DW$126, DW_AT_TI_symbol_name("REV_RTL")
    1769        .dwattr $C$DW$126, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    1770        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1772        .dwattr $C$DW$126, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1773        .dwattr $C$DW$126, DW_AT_decl_line(0x0d)
    1774        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1775$C$DW$127       .dwtag  DW_TAG_member
    1776        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    1777        .dwattr $C$DW$127, DW_AT_name("REV_MODULE")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   35

    1778        .dwattr $C$DW$127, DW_AT_TI_symbol_name("REV_MODULE")
    1779        .dwattr $C$DW$127, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    1780        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1781        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1782        .dwattr $C$DW$127, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1783        .dwattr $C$DW$127, DW_AT_decl_line(0x0e)
    1784        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1785$C$DW$128       .dwtag  DW_TAG_member
    1786        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1787        .dwattr $C$DW$128, DW_AT_name("rsvd28")
    1788        .dwattr $C$DW$128, DW_AT_TI_symbol_name("rsvd28")
    1789        .dwattr $C$DW$128, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1790        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1791        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1792        .dwattr $C$DW$128, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1793        .dwattr $C$DW$128, DW_AT_decl_line(0x0f)
    1794        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    1795$C$DW$129       .dwtag  DW_TAG_member
    1796        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    1797        .dwattr $C$DW$129, DW_AT_name("REV_SCHEME")
    1798        .dwattr $C$DW$129, DW_AT_TI_symbol_name("REV_SCHEME")
    1799        .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1800        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1801        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1802        .dwattr $C$DW$129, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1803        .dwattr $C$DW$129, DW_AT_decl_line(0x10)
    1804        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    1805        .dwendtag $C$DW$T$19
    1806
    1807        .dwattr $C$DW$T$19, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1808        .dwattr $C$DW$T$19, DW_AT_decl_line(0x09)
    1809        .dwattr $C$DW$T$19, DW_AT_decl_column(0x12)
    1810$C$DW$T$184     .dwtag  DW_TAG_volatile_type
    1811        .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$19)
    1812
    1813$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1814        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1815$C$DW$130       .dwtag  DW_TAG_member
    1816        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    1817        .dwattr $C$DW$130, DW_AT_name("rsvd0")
    1818        .dwattr $C$DW$130, DW_AT_TI_symbol_name("rsvd0")
    1819        .dwattr $C$DW$130, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1820        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1822        .dwattr $C$DW$130, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1823        .dwattr $C$DW$130, DW_AT_decl_line(0x1a)
    1824        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    1825$C$DW$131       .dwtag  DW_TAG_member
    1826        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    1827        .dwattr $C$DW$131, DW_AT_name("NEST_MODE")
    1828        .dwattr $C$DW$131, DW_AT_TI_symbol_name("NEST_MODE")
    1829        .dwattr $C$DW$131, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1830        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1831        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1832        .dwattr $C$DW$131, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   36

    1833        .dwattr $C$DW$131, DW_AT_decl_line(0x1b)
    1834        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    1835$C$DW$132       .dwtag  DW_TAG_member
    1836        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    1837        .dwattr $C$DW$132, DW_AT_name("rsvd4")
    1838        .dwattr $C$DW$132, DW_AT_TI_symbol_name("rsvd4")
    1839        .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    1840        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1841        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1842        .dwattr $C$DW$132, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1843        .dwattr $C$DW$132, DW_AT_decl_line(0x1c)
    1844        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    1845        .dwendtag $C$DW$T$20
    1846
    1847        .dwattr $C$DW$T$20, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1848        .dwattr $C$DW$T$20, DW_AT_decl_line(0x19)
    1849        .dwattr $C$DW$T$20, DW_AT_decl_column(0x12)
    1850$C$DW$T$186     .dwtag  DW_TAG_volatile_type
    1851        .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$20)
    1852
    1853$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1854        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1855$C$DW$133       .dwtag  DW_TAG_member
    1856        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    1857        .dwattr $C$DW$133, DW_AT_name("EN_HINT_ANY")
    1858        .dwattr $C$DW$133, DW_AT_TI_symbol_name("EN_HINT_ANY")
    1859        .dwattr $C$DW$133, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1860        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1861        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1862        .dwattr $C$DW$133, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1863        .dwattr $C$DW$133, DW_AT_decl_line(0x29)
    1864        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    1865$C$DW$134       .dwtag  DW_TAG_member
    1866        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    1867        .dwattr $C$DW$134, DW_AT_name("rsvd1")
    1868        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd1")
    1869        .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1870        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1871        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1872        .dwattr $C$DW$134, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1873        .dwattr $C$DW$134, DW_AT_decl_line(0x2a)
    1874        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    1875        .dwendtag $C$DW$T$21
    1876
    1877        .dwattr $C$DW$T$21, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1878        .dwattr $C$DW$T$21, DW_AT_decl_line(0x28)
    1879        .dwattr $C$DW$T$21, DW_AT_decl_column(0x12)
    1880$C$DW$T$188     .dwtag  DW_TAG_volatile_type
    1881        .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$21)
    1882
    1883$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1884        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1885$C$DW$135       .dwtag  DW_TAG_member
    1886        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    1887        .dwattr $C$DW$135, DW_AT_name("GLB_NEST_LEVEL")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   37

    1888        .dwattr $C$DW$135, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    1889        .dwattr $C$DW$135, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    1890        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1891        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1892        .dwattr $C$DW$135, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1893        .dwattr $C$DW$135, DW_AT_decl_line(0x37)
    1894        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    1895$C$DW$136       .dwtag  DW_TAG_member
    1896        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    1897        .dwattr $C$DW$136, DW_AT_name("rsvd9")
    1898        .dwattr $C$DW$136, DW_AT_TI_symbol_name("rsvd9")
    1899        .dwattr $C$DW$136, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    1900        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1902        .dwattr $C$DW$136, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1903        .dwattr $C$DW$136, DW_AT_decl_line(0x38)
    1904        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    1905$C$DW$137       .dwtag  DW_TAG_member
    1906        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    1907        .dwattr $C$DW$137, DW_AT_name("AUTO_OVERRIDE")
    1908        .dwattr $C$DW$137, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    1909        .dwattr $C$DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1910        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1911        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1912        .dwattr $C$DW$137, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1913        .dwattr $C$DW$137, DW_AT_decl_line(0x39)
    1914        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    1915        .dwendtag $C$DW$T$22
    1916
    1917        .dwattr $C$DW$T$22, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1918        .dwattr $C$DW$T$22, DW_AT_decl_line(0x36)
    1919        .dwattr $C$DW$T$22, DW_AT_decl_column(0x12)
    1920$C$DW$T$190     .dwtag  DW_TAG_volatile_type
    1921        .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$22)
    1922
    1923$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1924        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1925$C$DW$138       .dwtag  DW_TAG_member
    1926        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    1927        .dwattr $C$DW$138, DW_AT_name("STS_SET_IDX")
    1928        .dwattr $C$DW$138, DW_AT_TI_symbol_name("STS_SET_IDX")
    1929        .dwattr $C$DW$138, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    1930        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1931        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1932        .dwattr $C$DW$138, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1933        .dwattr $C$DW$138, DW_AT_decl_line(0x43)
    1934        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    1935$C$DW$139       .dwtag  DW_TAG_member
    1936        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    1937        .dwattr $C$DW$139, DW_AT_name("rsvd10")
    1938        .dwattr $C$DW$139, DW_AT_TI_symbol_name("rsvd10")
    1939        .dwattr $C$DW$139, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    1940        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1941        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1942        .dwattr $C$DW$139, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   38

    1943        .dwattr $C$DW$139, DW_AT_decl_line(0x44)
    1944        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    1945        .dwendtag $C$DW$T$23
    1946
    1947        .dwattr $C$DW$T$23, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1948        .dwattr $C$DW$T$23, DW_AT_decl_line(0x42)
    1949        .dwattr $C$DW$T$23, DW_AT_decl_column(0x12)
    1950$C$DW$T$192     .dwtag  DW_TAG_volatile_type
    1951        .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$23)
    1952
    1953$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1954        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1955$C$DW$140       .dwtag  DW_TAG_member
    1956        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    1957        .dwattr $C$DW$140, DW_AT_name("STS_CLR_IDX")
    1958        .dwattr $C$DW$140, DW_AT_TI_symbol_name("STS_CLR_IDX")
    1959        .dwattr $C$DW$140, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    1960        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1961        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1962        .dwattr $C$DW$140, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1963        .dwattr $C$DW$140, DW_AT_decl_line(0x4e)
    1964        .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    1965$C$DW$141       .dwtag  DW_TAG_member
    1966        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
    1967        .dwattr $C$DW$141, DW_AT_name("rsvd10")
    1968        .dwattr $C$DW$141, DW_AT_TI_symbol_name("rsvd10")
    1969        .dwattr $C$DW$141, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    1970        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1971        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1972        .dwattr $C$DW$141, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1973        .dwattr $C$DW$141, DW_AT_decl_line(0x4f)
    1974        .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    1975        .dwendtag $C$DW$T$24
    1976
    1977        .dwattr $C$DW$T$24, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1978        .dwattr $C$DW$T$24, DW_AT_decl_line(0x4d)
    1979        .dwattr $C$DW$T$24, DW_AT_decl_column(0x12)
    1980$C$DW$T$194     .dwtag  DW_TAG_volatile_type
    1981        .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$24)
    1982
    1983$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1984        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1985$C$DW$142       .dwtag  DW_TAG_member
    1986        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$11)
    1987        .dwattr $C$DW$142, DW_AT_name("EN_SET_IDX")
    1988        .dwattr $C$DW$142, DW_AT_TI_symbol_name("EN_SET_IDX")
    1989        .dwattr $C$DW$142, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    1990        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1992        .dwattr $C$DW$142, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    1993        .dwattr $C$DW$142, DW_AT_decl_line(0x59)
    1994        .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    1995$C$DW$143       .dwtag  DW_TAG_member
    1996        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$11)
    1997        .dwattr $C$DW$143, DW_AT_name("rsvd10")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   39

    1998        .dwattr $C$DW$143, DW_AT_TI_symbol_name("rsvd10")
    1999        .dwattr $C$DW$143, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2000        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2002        .dwattr $C$DW$143, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2003        .dwattr $C$DW$143, DW_AT_decl_line(0x5a)
    2004        .dwattr $C$DW$143, DW_AT_decl_column(0x0d)
    2005        .dwendtag $C$DW$T$25
    2006
    2007        .dwattr $C$DW$T$25, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2008        .dwattr $C$DW$T$25, DW_AT_decl_line(0x58)
    2009        .dwattr $C$DW$T$25, DW_AT_decl_column(0x12)
    2010$C$DW$T$196     .dwtag  DW_TAG_volatile_type
    2011        .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$25)
    2012
    2013$C$DW$T$26      .dwtag  DW_TAG_structure_type
    2014        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    2015$C$DW$144       .dwtag  DW_TAG_member
    2016        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$11)
    2017        .dwattr $C$DW$144, DW_AT_name("EN_CLR_IDX")
    2018        .dwattr $C$DW$144, DW_AT_TI_symbol_name("EN_CLR_IDX")
    2019        .dwattr $C$DW$144, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2020        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2021        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2022        .dwattr $C$DW$144, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2023        .dwattr $C$DW$144, DW_AT_decl_line(0x64)
    2024        .dwattr $C$DW$144, DW_AT_decl_column(0x0d)
    2025$C$DW$145       .dwtag  DW_TAG_member
    2026        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$11)
    2027        .dwattr $C$DW$145, DW_AT_name("rsvd10")
    2028        .dwattr $C$DW$145, DW_AT_TI_symbol_name("rsvd10")
    2029        .dwattr $C$DW$145, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2030        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2031        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2032        .dwattr $C$DW$145, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2033        .dwattr $C$DW$145, DW_AT_decl_line(0x65)
    2034        .dwattr $C$DW$145, DW_AT_decl_column(0x0d)
    2035        .dwendtag $C$DW$T$26
    2036
    2037        .dwattr $C$DW$T$26, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2038        .dwattr $C$DW$T$26, DW_AT_decl_line(0x63)
    2039        .dwattr $C$DW$T$26, DW_AT_decl_column(0x12)
    2040$C$DW$T$198     .dwtag  DW_TAG_volatile_type
    2041        .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$26)
    2042
    2043$C$DW$T$27      .dwtag  DW_TAG_structure_type
    2044        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2045$C$DW$146       .dwtag  DW_TAG_member
    2046        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$11)
    2047        .dwattr $C$DW$146, DW_AT_name("HINT_EN_SET_IDX")
    2048        .dwattr $C$DW$146, DW_AT_TI_symbol_name("HINT_EN_SET_IDX")
    2049        .dwattr $C$DW$146, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2050        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2052        .dwattr $C$DW$146, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   40

    2053        .dwattr $C$DW$146, DW_AT_decl_line(0x72)
    2054        .dwattr $C$DW$146, DW_AT_decl_column(0x0d)
    2055$C$DW$147       .dwtag  DW_TAG_member
    2056        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$11)
    2057        .dwattr $C$DW$147, DW_AT_name("rsvd10")
    2058        .dwattr $C$DW$147, DW_AT_TI_symbol_name("rsvd10")
    2059        .dwattr $C$DW$147, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2060        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2061        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2062        .dwattr $C$DW$147, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2063        .dwattr $C$DW$147, DW_AT_decl_line(0x73)
    2064        .dwattr $C$DW$147, DW_AT_decl_column(0x0d)
    2065        .dwendtag $C$DW$T$27
    2066
    2067        .dwattr $C$DW$T$27, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2068        .dwattr $C$DW$T$27, DW_AT_decl_line(0x71)
    2069        .dwattr $C$DW$T$27, DW_AT_decl_column(0x12)
    2070$C$DW$T$200     .dwtag  DW_TAG_volatile_type
    2071        .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$27)
    2072
    2073$C$DW$T$28      .dwtag  DW_TAG_structure_type
    2074        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    2075$C$DW$148       .dwtag  DW_TAG_member
    2076        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$11)
    2077        .dwattr $C$DW$148, DW_AT_name("HINT_EN_CLR_IDX")
    2078        .dwattr $C$DW$148, DW_AT_TI_symbol_name("HINT_EN_CLR_IDX")
    2079        .dwattr $C$DW$148, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2080        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2082        .dwattr $C$DW$148, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2083        .dwattr $C$DW$148, DW_AT_decl_line(0x7d)
    2084        .dwattr $C$DW$148, DW_AT_decl_column(0x0d)
    2085$C$DW$149       .dwtag  DW_TAG_member
    2086        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$11)
    2087        .dwattr $C$DW$149, DW_AT_name("rsvd10")
    2088        .dwattr $C$DW$149, DW_AT_TI_symbol_name("rsvd10")
    2089        .dwattr $C$DW$149, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2090        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2091        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2092        .dwattr $C$DW$149, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2093        .dwattr $C$DW$149, DW_AT_decl_line(0x7e)
    2094        .dwattr $C$DW$149, DW_AT_decl_column(0x0d)
    2095        .dwendtag $C$DW$T$28
    2096
    2097        .dwattr $C$DW$T$28, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2098        .dwattr $C$DW$T$28, DW_AT_decl_line(0x7c)
    2099        .dwattr $C$DW$T$28, DW_AT_decl_column(0x12)
    2100$C$DW$T$202     .dwtag  DW_TAG_volatile_type
    2101        .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$28)
    2102
    2103$C$DW$T$29      .dwtag  DW_TAG_structure_type
    2104        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2105$C$DW$150       .dwtag  DW_TAG_member
    2106        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$11)
    2107        .dwattr $C$DW$150, DW_AT_name("GLB_PRI_INTR")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   41

    2108        .dwattr $C$DW$150, DW_AT_TI_symbol_name("GLB_PRI_INTR")
    2109        .dwattr $C$DW$150, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2110        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2111        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2112        .dwattr $C$DW$150, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2113        .dwattr $C$DW$150, DW_AT_decl_line(0x8b)
    2114        .dwattr $C$DW$150, DW_AT_decl_column(0x0d)
    2115$C$DW$151       .dwtag  DW_TAG_member
    2116        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$11)
    2117        .dwattr $C$DW$151, DW_AT_name("rsvd10")
    2118        .dwattr $C$DW$151, DW_AT_TI_symbol_name("rsvd10")
    2119        .dwattr $C$DW$151, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x15)
    2120        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2121        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2122        .dwattr $C$DW$151, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2123        .dwattr $C$DW$151, DW_AT_decl_line(0x8c)
    2124        .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    2125$C$DW$152       .dwtag  DW_TAG_member
    2126        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
    2127        .dwattr $C$DW$152, DW_AT_name("GLB_NONE")
    2128        .dwattr $C$DW$152, DW_AT_TI_symbol_name("GLB_NONE")
    2129        .dwattr $C$DW$152, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2130        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2131        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2132        .dwattr $C$DW$152, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2133        .dwattr $C$DW$152, DW_AT_decl_line(0x8d)
    2134        .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    2135        .dwendtag $C$DW$T$29
    2136
    2137        .dwattr $C$DW$T$29, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2138        .dwattr $C$DW$T$29, DW_AT_decl_line(0x8a)
    2139        .dwattr $C$DW$T$29, DW_AT_decl_column(0x12)
    2140$C$DW$T$204     .dwtag  DW_TAG_volatile_type
    2141        .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$29)
    2142
    2143$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2144        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2145$C$DW$153       .dwtag  DW_TAG_member
    2146        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    2147        .dwattr $C$DW$153, DW_AT_name("RAW_STS_31_0")
    2148        .dwattr $C$DW$153, DW_AT_TI_symbol_name("RAW_STS_31_0")
    2149        .dwattr $C$DW$153, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    2150        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2151        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2152        .dwattr $C$DW$153, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2153        .dwattr $C$DW$153, DW_AT_decl_line(0x9a)
    2154        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    2155        .dwendtag $C$DW$T$30
    2156
    2157        .dwattr $C$DW$T$30, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2158        .dwattr $C$DW$T$30, DW_AT_decl_line(0x99)
    2159        .dwattr $C$DW$T$30, DW_AT_decl_column(0x12)
    2160$C$DW$T$206     .dwtag  DW_TAG_volatile_type
    2161        .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$30)
    2162
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   42

    2163$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2164        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2165$C$DW$154       .dwtag  DW_TAG_member
    2166        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    2167        .dwattr $C$DW$154, DW_AT_name("RAW_STS_63_32")
    2168        .dwattr $C$DW$154, DW_AT_TI_symbol_name("RAW_STS_63_32")
    2169        .dwattr $C$DW$154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    2170        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2171        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2172        .dwattr $C$DW$154, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2173        .dwattr $C$DW$154, DW_AT_decl_line(0xa4)
    2174        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2175        .dwendtag $C$DW$T$31
    2176
    2177        .dwattr $C$DW$T$31, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2178        .dwattr $C$DW$T$31, DW_AT_decl_line(0xa3)
    2179        .dwattr $C$DW$T$31, DW_AT_decl_column(0x12)
    2180$C$DW$T$208     .dwtag  DW_TAG_volatile_type
    2181        .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$31)
    2182
    2183$C$DW$T$32      .dwtag  DW_TAG_structure_type
    2184        .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    2185$C$DW$155       .dwtag  DW_TAG_member
    2186        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    2187        .dwattr $C$DW$155, DW_AT_name("ENA_STS_31_0")
    2188        .dwattr $C$DW$155, DW_AT_TI_symbol_name("ENA_STS_31_0")
    2189        .dwattr $C$DW$155, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    2190        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2191        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2192        .dwattr $C$DW$155, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2193        .dwattr $C$DW$155, DW_AT_decl_line(0xb1)
    2194        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    2195        .dwendtag $C$DW$T$32
    2196
    2197        .dwattr $C$DW$T$32, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2198        .dwattr $C$DW$T$32, DW_AT_decl_line(0xb0)
    2199        .dwattr $C$DW$T$32, DW_AT_decl_column(0x12)
    2200$C$DW$T$210     .dwtag  DW_TAG_volatile_type
    2201        .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$32)
    2202
    2203$C$DW$T$33      .dwtag  DW_TAG_structure_type
    2204        .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    2205$C$DW$156       .dwtag  DW_TAG_member
    2206        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    2207        .dwattr $C$DW$156, DW_AT_name("ENA_STS_63_32")
    2208        .dwattr $C$DW$156, DW_AT_TI_symbol_name("ENA_STS_63_32")
    2209        .dwattr $C$DW$156, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    2210        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2211        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2212        .dwattr $C$DW$156, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2213        .dwattr $C$DW$156, DW_AT_decl_line(0xbb)
    2214        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    2215        .dwendtag $C$DW$T$33
    2216
    2217        .dwattr $C$DW$T$33, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   43

    2218        .dwattr $C$DW$T$33, DW_AT_decl_line(0xba)
    2219        .dwattr $C$DW$T$33, DW_AT_decl_column(0x12)
    2220$C$DW$T$212     .dwtag  DW_TAG_volatile_type
    2221        .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$33)
    2222
    2223$C$DW$T$34      .dwtag  DW_TAG_structure_type
    2224        .dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
    2225$C$DW$157       .dwtag  DW_TAG_member
    2226        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    2227        .dwattr $C$DW$157, DW_AT_name("EN_SET_31_0")
    2228        .dwattr $C$DW$157, DW_AT_TI_symbol_name("EN_SET_31_0")
    2229        .dwattr $C$DW$157, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    2230        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2231        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2232        .dwattr $C$DW$157, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2233        .dwattr $C$DW$157, DW_AT_decl_line(0xc8)
    2234        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2235        .dwendtag $C$DW$T$34
    2236
    2237        .dwattr $C$DW$T$34, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2238        .dwattr $C$DW$T$34, DW_AT_decl_line(0xc7)
    2239        .dwattr $C$DW$T$34, DW_AT_decl_column(0x12)
    2240$C$DW$T$214     .dwtag  DW_TAG_volatile_type
    2241        .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$34)
    2242
    2243$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2244        .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    2245$C$DW$158       .dwtag  DW_TAG_member
    2246        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2247        .dwattr $C$DW$158, DW_AT_name("EN_SET_63_32")
    2248        .dwattr $C$DW$158, DW_AT_TI_symbol_name("EN_SET_63_32")
    2249        .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    2250        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2251        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2252        .dwattr $C$DW$158, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2253        .dwattr $C$DW$158, DW_AT_decl_line(0xd2)
    2254        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    2255        .dwendtag $C$DW$T$35
    2256
    2257        .dwattr $C$DW$T$35, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2258        .dwattr $C$DW$T$35, DW_AT_decl_line(0xd1)
    2259        .dwattr $C$DW$T$35, DW_AT_decl_column(0x12)
    2260$C$DW$T$216     .dwtag  DW_TAG_volatile_type
    2261        .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$35)
    2262
    2263$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2264        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2265$C$DW$159       .dwtag  DW_TAG_member
    2266        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    2267        .dwattr $C$DW$159, DW_AT_name("EN_CLR_31_0")
    2268        .dwattr $C$DW$159, DW_AT_TI_symbol_name("EN_CLR_31_0")
    2269        .dwattr $C$DW$159, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    2270        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2271        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2272        .dwattr $C$DW$159, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   44

    2273        .dwattr $C$DW$159, DW_AT_decl_line(0xdf)
    2274        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2275        .dwendtag $C$DW$T$36
    2276
    2277        .dwattr $C$DW$T$36, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2278        .dwattr $C$DW$T$36, DW_AT_decl_line(0xde)
    2279        .dwattr $C$DW$T$36, DW_AT_decl_column(0x12)
    2280$C$DW$T$218     .dwtag  DW_TAG_volatile_type
    2281        .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$36)
    2282
    2283$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2284        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2285$C$DW$160       .dwtag  DW_TAG_member
    2286        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2287        .dwattr $C$DW$160, DW_AT_name("EN_CLR_63_32")
    2288        .dwattr $C$DW$160, DW_AT_TI_symbol_name("EN_CLR_63_32")
    2289        .dwattr $C$DW$160, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    2290        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2291        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2292        .dwattr $C$DW$160, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2293        .dwattr $C$DW$160, DW_AT_decl_line(0xe9)
    2294        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2295        .dwendtag $C$DW$T$37
    2296
    2297        .dwattr $C$DW$T$37, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2298        .dwattr $C$DW$T$37, DW_AT_decl_line(0xe8)
    2299        .dwattr $C$DW$T$37, DW_AT_decl_column(0x12)
    2300$C$DW$T$220     .dwtag  DW_TAG_volatile_type
    2301        .dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$37)
    2302
    2303$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2304        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2305$C$DW$161       .dwtag  DW_TAG_member
    2306        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2307        .dwattr $C$DW$161, DW_AT_name("CH_MAP_0")
    2308        .dwattr $C$DW$161, DW_AT_TI_symbol_name("CH_MAP_0")
    2309        .dwattr $C$DW$161, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2310        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2311        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2312        .dwattr $C$DW$161, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2313        .dwattr $C$DW$161, DW_AT_decl_line(0xf6)
    2314        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2315$C$DW$162       .dwtag  DW_TAG_member
    2316        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2317        .dwattr $C$DW$162, DW_AT_name("rsvd4")
    2318        .dwattr $C$DW$162, DW_AT_TI_symbol_name("rsvd4")
    2319        .dwattr $C$DW$162, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2320        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2321        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2322        .dwattr $C$DW$162, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2323        .dwattr $C$DW$162, DW_AT_decl_line(0xf7)
    2324        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2325$C$DW$163       .dwtag  DW_TAG_member
    2326        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2327        .dwattr $C$DW$163, DW_AT_name("CH_MAP_1")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   45

    2328        .dwattr $C$DW$163, DW_AT_TI_symbol_name("CH_MAP_1")
    2329        .dwattr $C$DW$163, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2330        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2331        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2332        .dwattr $C$DW$163, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2333        .dwattr $C$DW$163, DW_AT_decl_line(0xf8)
    2334        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2335$C$DW$164       .dwtag  DW_TAG_member
    2336        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2337        .dwattr $C$DW$164, DW_AT_name("rsvd12")
    2338        .dwattr $C$DW$164, DW_AT_TI_symbol_name("rsvd12")
    2339        .dwattr $C$DW$164, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2340        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2342        .dwattr $C$DW$164, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2343        .dwattr $C$DW$164, DW_AT_decl_line(0xf9)
    2344        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2345$C$DW$165       .dwtag  DW_TAG_member
    2346        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2347        .dwattr $C$DW$165, DW_AT_name("CH_MAP_2")
    2348        .dwattr $C$DW$165, DW_AT_TI_symbol_name("CH_MAP_2")
    2349        .dwattr $C$DW$165, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2350        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2351        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2352        .dwattr $C$DW$165, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2353        .dwattr $C$DW$165, DW_AT_decl_line(0xfa)
    2354        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2355$C$DW$166       .dwtag  DW_TAG_member
    2356        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2357        .dwattr $C$DW$166, DW_AT_name("rsvd20")
    2358        .dwattr $C$DW$166, DW_AT_TI_symbol_name("rsvd20")
    2359        .dwattr $C$DW$166, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    2360        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2361        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2362        .dwattr $C$DW$166, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2363        .dwattr $C$DW$166, DW_AT_decl_line(0xfb)
    2364        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2365$C$DW$167       .dwtag  DW_TAG_member
    2366        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    2367        .dwattr $C$DW$167, DW_AT_name("CH_MAP_3")
    2368        .dwattr $C$DW$167, DW_AT_TI_symbol_name("CH_MAP_3")
    2369        .dwattr $C$DW$167, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    2370        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2372        .dwattr $C$DW$167, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2373        .dwattr $C$DW$167, DW_AT_decl_line(0xfc)
    2374        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2375$C$DW$168       .dwtag  DW_TAG_member
    2376        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    2377        .dwattr $C$DW$168, DW_AT_name("rsvd28")
    2378        .dwattr $C$DW$168, DW_AT_TI_symbol_name("rsvd28")
    2379        .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2380        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2381        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2382        .dwattr $C$DW$168, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   46

    2383        .dwattr $C$DW$168, DW_AT_decl_line(0xfd)
    2384        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2385        .dwendtag $C$DW$T$38
    2386
    2387        .dwattr $C$DW$T$38, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2388        .dwattr $C$DW$T$38, DW_AT_decl_line(0xf5)
    2389        .dwattr $C$DW$T$38, DW_AT_decl_column(0x12)
    2390$C$DW$T$222     .dwtag  DW_TAG_volatile_type
    2391        .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$38)
    2392
    2393$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2394        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2395$C$DW$169       .dwtag  DW_TAG_member
    2396        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    2397        .dwattr $C$DW$169, DW_AT_name("CH_MAP_4")
    2398        .dwattr $C$DW$169, DW_AT_TI_symbol_name("CH_MAP_4")
    2399        .dwattr $C$DW$169, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2400        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2401        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2402        .dwattr $C$DW$169, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2403        .dwattr $C$DW$169, DW_AT_decl_line(0x107)
    2404        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2405$C$DW$170       .dwtag  DW_TAG_member
    2406        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$11)
    2407        .dwattr $C$DW$170, DW_AT_name("rsvd4")
    2408        .dwattr $C$DW$170, DW_AT_TI_symbol_name("rsvd4")
    2409        .dwattr $C$DW$170, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2410        .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2411        .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2412        .dwattr $C$DW$170, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2413        .dwattr $C$DW$170, DW_AT_decl_line(0x108)
    2414        .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    2415$C$DW$171       .dwtag  DW_TAG_member
    2416        .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$11)
    2417        .dwattr $C$DW$171, DW_AT_name("CH_MAP_5")
    2418        .dwattr $C$DW$171, DW_AT_TI_symbol_name("CH_MAP_5")
    2419        .dwattr $C$DW$171, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2420        .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2421        .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2422        .dwattr $C$DW$171, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2423        .dwattr $C$DW$171, DW_AT_decl_line(0x109)
    2424        .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    2425$C$DW$172       .dwtag  DW_TAG_member
    2426        .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$11)
    2427        .dwattr $C$DW$172, DW_AT_name("rsvd12")
    2428        .dwattr $C$DW$172, DW_AT_TI_symbol_name("rsvd12")
    2429        .dwattr $C$DW$172, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2430        .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2431        .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2432        .dwattr $C$DW$172, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2433        .dwattr $C$DW$172, DW_AT_decl_line(0x10a)
    2434        .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    2435$C$DW$173       .dwtag  DW_TAG_member
    2436        .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$11)
    2437        .dwattr $C$DW$173, DW_AT_name("CH_MAP_6")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   47

    2438        .dwattr $C$DW$173, DW_AT_TI_symbol_name("CH_MAP_6")
    2439        .dwattr $C$DW$173, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2440        .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2441        .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2442        .dwattr $C$DW$173, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2443        .dwattr $C$DW$173, DW_AT_decl_line(0x10b)
    2444        .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    2445$C$DW$174       .dwtag  DW_TAG_member
    2446        .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$11)
    2447        .dwattr $C$DW$174, DW_AT_name("rsvd20")
    2448        .dwattr $C$DW$174, DW_AT_TI_symbol_name("rsvd20")
    2449        .dwattr $C$DW$174, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    2450        .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2451        .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2452        .dwattr $C$DW$174, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2453        .dwattr $C$DW$174, DW_AT_decl_line(0x10c)
    2454        .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    2455$C$DW$175       .dwtag  DW_TAG_member
    2456        .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$11)
    2457        .dwattr $C$DW$175, DW_AT_name("CH_MAP_7")
    2458        .dwattr $C$DW$175, DW_AT_TI_symbol_name("CH_MAP_7")
    2459        .dwattr $C$DW$175, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    2460        .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2461        .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2462        .dwattr $C$DW$175, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2463        .dwattr $C$DW$175, DW_AT_decl_line(0x10d)
    2464        .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    2465$C$DW$176       .dwtag  DW_TAG_member
    2466        .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$11)
    2467        .dwattr $C$DW$176, DW_AT_name("rsvd28")
    2468        .dwattr $C$DW$176, DW_AT_TI_symbol_name("rsvd28")
    2469        .dwattr $C$DW$176, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2470        .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2471        .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2472        .dwattr $C$DW$176, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2473        .dwattr $C$DW$176, DW_AT_decl_line(0x10e)
    2474        .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    2475        .dwendtag $C$DW$T$39
    2476
    2477        .dwattr $C$DW$T$39, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2478        .dwattr $C$DW$T$39, DW_AT_decl_line(0x106)
    2479        .dwattr $C$DW$T$39, DW_AT_decl_column(0x12)
    2480$C$DW$T$224     .dwtag  DW_TAG_volatile_type
    2481        .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$39)
    2482
    2483$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2484        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2485$C$DW$177       .dwtag  DW_TAG_member
    2486        .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$11)
    2487        .dwattr $C$DW$177, DW_AT_name("CH_MAP_8")
    2488        .dwattr $C$DW$177, DW_AT_TI_symbol_name("CH_MAP_8")
    2489        .dwattr $C$DW$177, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2490        .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2491        .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2492        .dwattr $C$DW$177, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   48

    2493        .dwattr $C$DW$177, DW_AT_decl_line(0x118)
    2494        .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
    2495$C$DW$178       .dwtag  DW_TAG_member
    2496        .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$11)
    2497        .dwattr $C$DW$178, DW_AT_name("rsvd4")
    2498        .dwattr $C$DW$178, DW_AT_TI_symbol_name("rsvd4")
    2499        .dwattr $C$DW$178, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2500        .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2501        .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2502        .dwattr $C$DW$178, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2503        .dwattr $C$DW$178, DW_AT_decl_line(0x119)
    2504        .dwattr $C$DW$178, DW_AT_decl_column(0x0d)
    2505$C$DW$179       .dwtag  DW_TAG_member
    2506        .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$11)
    2507        .dwattr $C$DW$179, DW_AT_name("CH_MAP_9")
    2508        .dwattr $C$DW$179, DW_AT_TI_symbol_name("CH_MAP_9")
    2509        .dwattr $C$DW$179, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2510        .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2511        .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2512        .dwattr $C$DW$179, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2513        .dwattr $C$DW$179, DW_AT_decl_line(0x11a)
    2514        .dwattr $C$DW$179, DW_AT_decl_column(0x0d)
    2515$C$DW$180       .dwtag  DW_TAG_member
    2516        .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$11)
    2517        .dwattr $C$DW$180, DW_AT_name("rsvd12")
    2518        .dwattr $C$DW$180, DW_AT_TI_symbol_name("rsvd12")
    2519        .dwattr $C$DW$180, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2520        .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2521        .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2522        .dwattr $C$DW$180, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2523        .dwattr $C$DW$180, DW_AT_decl_line(0x11b)
    2524        .dwattr $C$DW$180, DW_AT_decl_column(0x0d)
    2525$C$DW$181       .dwtag  DW_TAG_member
    2526        .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$11)
    2527        .dwattr $C$DW$181, DW_AT_name("CH_MAP_10")
    2528        .dwattr $C$DW$181, DW_AT_TI_symbol_name("CH_MAP_10")
    2529        .dwattr $C$DW$181, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2530        .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2531        .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2532        .dwattr $C$DW$181, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2533        .dwattr $C$DW$181, DW_AT_decl_line(0x11c)
    2534        .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    2535$C$DW$182       .dwtag  DW_TAG_member
    2536        .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$11)
    2537        .dwattr $C$DW$182, DW_AT_name("rsvd20")
    2538        .dwattr $C$DW$182, DW_AT_TI_symbol_name("rsvd20")
    2539        .dwattr $C$DW$182, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    2540        .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2541        .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2542        .dwattr $C$DW$182, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2543        .dwattr $C$DW$182, DW_AT_decl_line(0x11d)
    2544        .dwattr $C$DW$182, DW_AT_decl_column(0x0d)
    2545$C$DW$183       .dwtag  DW_TAG_member
    2546        .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$11)
    2547        .dwattr $C$DW$183, DW_AT_name("CH_MAP_11")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   49

    2548        .dwattr $C$DW$183, DW_AT_TI_symbol_name("CH_MAP_11")
    2549        .dwattr $C$DW$183, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    2550        .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2551        .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2552        .dwattr $C$DW$183, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2553        .dwattr $C$DW$183, DW_AT_decl_line(0x11e)
    2554        .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    2555$C$DW$184       .dwtag  DW_TAG_member
    2556        .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$11)
    2557        .dwattr $C$DW$184, DW_AT_name("rsvd28")
    2558        .dwattr $C$DW$184, DW_AT_TI_symbol_name("rsvd28")
    2559        .dwattr $C$DW$184, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2560        .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2561        .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2562        .dwattr $C$DW$184, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2563        .dwattr $C$DW$184, DW_AT_decl_line(0x11f)
    2564        .dwattr $C$DW$184, DW_AT_decl_column(0x0d)
    2565        .dwendtag $C$DW$T$40
    2566
    2567        .dwattr $C$DW$T$40, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2568        .dwattr $C$DW$T$40, DW_AT_decl_line(0x117)
    2569        .dwattr $C$DW$T$40, DW_AT_decl_column(0x12)
    2570$C$DW$T$226     .dwtag  DW_TAG_volatile_type
    2571        .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$40)
    2572
    2573$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2574        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2575$C$DW$185       .dwtag  DW_TAG_member
    2576        .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$11)
    2577        .dwattr $C$DW$185, DW_AT_name("CH_MAP_12")
    2578        .dwattr $C$DW$185, DW_AT_TI_symbol_name("CH_MAP_12")
    2579        .dwattr $C$DW$185, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2580        .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2581        .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2582        .dwattr $C$DW$185, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2583        .dwattr $C$DW$185, DW_AT_decl_line(0x129)
    2584        .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    2585$C$DW$186       .dwtag  DW_TAG_member
    2586        .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$11)
    2587        .dwattr $C$DW$186, DW_AT_name("rsvd4")
    2588        .dwattr $C$DW$186, DW_AT_TI_symbol_name("rsvd4")
    2589        .dwattr $C$DW$186, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2590        .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2591        .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2592        .dwattr $C$DW$186, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2593        .dwattr $C$DW$186, DW_AT_decl_line(0x12a)
    2594        .dwattr $C$DW$186, DW_AT_decl_column(0x0d)
    2595$C$DW$187       .dwtag  DW_TAG_member
    2596        .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$11)
    2597        .dwattr $C$DW$187, DW_AT_name("CH_MAP_13")
    2598        .dwattr $C$DW$187, DW_AT_TI_symbol_name("CH_MAP_13")
    2599        .dwattr $C$DW$187, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2600        .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2601        .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2602        .dwattr $C$DW$187, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   50

    2603        .dwattr $C$DW$187, DW_AT_decl_line(0x12b)
    2604        .dwattr $C$DW$187, DW_AT_decl_column(0x0d)
    2605$C$DW$188       .dwtag  DW_TAG_member
    2606        .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$11)
    2607        .dwattr $C$DW$188, DW_AT_name("rsvd12")
    2608        .dwattr $C$DW$188, DW_AT_TI_symbol_name("rsvd12")
    2609        .dwattr $C$DW$188, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2610        .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2611        .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2612        .dwattr $C$DW$188, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2613        .dwattr $C$DW$188, DW_AT_decl_line(0x12c)
    2614        .dwattr $C$DW$188, DW_AT_decl_column(0x0d)
    2615$C$DW$189       .dwtag  DW_TAG_member
    2616        .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$11)
    2617        .dwattr $C$DW$189, DW_AT_name("CH_MAP_14")
    2618        .dwattr $C$DW$189, DW_AT_TI_symbol_name("CH_MAP_14")
    2619        .dwattr $C$DW$189, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2620        .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2621        .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2622        .dwattr $C$DW$189, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2623        .dwattr $C$DW$189, DW_AT_decl_line(0x12d)
    2624        .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    2625$C$DW$190       .dwtag  DW_TAG_member
    2626        .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$11)
    2627        .dwattr $C$DW$190, DW_AT_name("rsvd20")
    2628        .dwattr $C$DW$190, DW_AT_TI_symbol_name("rsvd20")
    2629        .dwattr $C$DW$190, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    2630        .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2631        .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2632        .dwattr $C$DW$190, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2633        .dwattr $C$DW$190, DW_AT_decl_line(0x12e)
    2634        .dwattr $C$DW$190, DW_AT_decl_column(0x0d)
    2635$C$DW$191       .dwtag  DW_TAG_member
    2636        .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$11)
    2637        .dwattr $C$DW$191, DW_AT_name("CH_MAP_15")
    2638        .dwattr $C$DW$191, DW_AT_TI_symbol_name("CH_MAP_15")
    2639        .dwattr $C$DW$191, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    2640        .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2641        .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2642        .dwattr $C$DW$191, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2643        .dwattr $C$DW$191, DW_AT_decl_line(0x12f)
    2644        .dwattr $C$DW$191, DW_AT_decl_column(0x0d)
    2645$C$DW$192       .dwtag  DW_TAG_member
    2646        .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$11)
    2647        .dwattr $C$DW$192, DW_AT_name("rsvd28")
    2648        .dwattr $C$DW$192, DW_AT_TI_symbol_name("rsvd28")
    2649        .dwattr $C$DW$192, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2650        .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2651        .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2652        .dwattr $C$DW$192, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2653        .dwattr $C$DW$192, DW_AT_decl_line(0x130)
    2654        .dwattr $C$DW$192, DW_AT_decl_column(0x0d)
    2655        .dwendtag $C$DW$T$41
    2656
    2657        .dwattr $C$DW$T$41, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   51

    2658        .dwattr $C$DW$T$41, DW_AT_decl_line(0x128)
    2659        .dwattr $C$DW$T$41, DW_AT_decl_column(0x12)
    2660$C$DW$T$228     .dwtag  DW_TAG_volatile_type
    2661        .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$41)
    2662
    2663$C$DW$T$42      .dwtag  DW_TAG_structure_type
    2664        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    2665$C$DW$193       .dwtag  DW_TAG_member
    2666        .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$11)
    2667        .dwattr $C$DW$193, DW_AT_name("CH_MAP_16")
    2668        .dwattr $C$DW$193, DW_AT_TI_symbol_name("CH_MAP_16")
    2669        .dwattr $C$DW$193, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2670        .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2671        .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2672        .dwattr $C$DW$193, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2673        .dwattr $C$DW$193, DW_AT_decl_line(0x13a)
    2674        .dwattr $C$DW$193, DW_AT_decl_column(0x0d)
    2675$C$DW$194       .dwtag  DW_TAG_member
    2676        .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$11)
    2677        .dwattr $C$DW$194, DW_AT_name("rsvd4")
    2678        .dwattr $C$DW$194, DW_AT_TI_symbol_name("rsvd4")
    2679        .dwattr $C$DW$194, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2680        .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2681        .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2682        .dwattr $C$DW$194, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2683        .dwattr $C$DW$194, DW_AT_decl_line(0x13b)
    2684        .dwattr $C$DW$194, DW_AT_decl_column(0x0d)
    2685$C$DW$195       .dwtag  DW_TAG_member
    2686        .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$11)
    2687        .dwattr $C$DW$195, DW_AT_name("CH_MAP_17")
    2688        .dwattr $C$DW$195, DW_AT_TI_symbol_name("CH_MAP_17")
    2689        .dwattr $C$DW$195, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2690        .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2691        .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2692        .dwattr $C$DW$195, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2693        .dwattr $C$DW$195, DW_AT_decl_line(0x13c)
    2694        .dwattr $C$DW$195, DW_AT_decl_column(0x0d)
    2695$C$DW$196       .dwtag  DW_TAG_member
    2696        .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$11)
    2697        .dwattr $C$DW$196, DW_AT_name("rsvd12")
    2698        .dwattr $C$DW$196, DW_AT_TI_symbol_name("rsvd12")
    2699        .dwattr $C$DW$196, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2700        .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2701        .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2702        .dwattr $C$DW$196, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2703        .dwattr $C$DW$196, DW_AT_decl_line(0x13d)
    2704        .dwattr $C$DW$196, DW_AT_decl_column(0x0d)
    2705$C$DW$197       .dwtag  DW_TAG_member
    2706        .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$11)
    2707        .dwattr $C$DW$197, DW_AT_name("CH_MAP_18")
    2708        .dwattr $C$DW$197, DW_AT_TI_symbol_name("CH_MAP_18")
    2709        .dwattr $C$DW$197, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2710        .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2711        .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2712        .dwattr $C$DW$197, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   52

    2713        .dwattr $C$DW$197, DW_AT_decl_line(0x13e)
    2714        .dwattr $C$DW$197, DW_AT_decl_column(0x0d)
    2715$C$DW$198       .dwtag  DW_TAG_member
    2716        .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$11)
    2717        .dwattr $C$DW$198, DW_AT_name("rsvd20")
    2718        .dwattr $C$DW$198, DW_AT_TI_symbol_name("rsvd20")
    2719        .dwattr $C$DW$198, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    2720        .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2721        .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2722        .dwattr $C$DW$198, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2723        .dwattr $C$DW$198, DW_AT_decl_line(0x13f)
    2724        .dwattr $C$DW$198, DW_AT_decl_column(0x0d)
    2725$C$DW$199       .dwtag  DW_TAG_member
    2726        .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$11)
    2727        .dwattr $C$DW$199, DW_AT_name("CH_MAP_19")
    2728        .dwattr $C$DW$199, DW_AT_TI_symbol_name("CH_MAP_19")
    2729        .dwattr $C$DW$199, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    2730        .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2731        .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2732        .dwattr $C$DW$199, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2733        .dwattr $C$DW$199, DW_AT_decl_line(0x140)
    2734        .dwattr $C$DW$199, DW_AT_decl_column(0x0d)
    2735$C$DW$200       .dwtag  DW_TAG_member
    2736        .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$11)
    2737        .dwattr $C$DW$200, DW_AT_name("rsvd28")
    2738        .dwattr $C$DW$200, DW_AT_TI_symbol_name("rsvd28")
    2739        .dwattr $C$DW$200, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2740        .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2741        .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2742        .dwattr $C$DW$200, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2743        .dwattr $C$DW$200, DW_AT_decl_line(0x141)
    2744        .dwattr $C$DW$200, DW_AT_decl_column(0x0d)
    2745        .dwendtag $C$DW$T$42
    2746
    2747        .dwattr $C$DW$T$42, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2748        .dwattr $C$DW$T$42, DW_AT_decl_line(0x139)
    2749        .dwattr $C$DW$T$42, DW_AT_decl_column(0x12)
    2750$C$DW$T$230     .dwtag  DW_TAG_volatile_type
    2751        .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$42)
    2752
    2753$C$DW$T$43      .dwtag  DW_TAG_structure_type
    2754        .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    2755$C$DW$201       .dwtag  DW_TAG_member
    2756        .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$11)
    2757        .dwattr $C$DW$201, DW_AT_name("CH_MAP_20")
    2758        .dwattr $C$DW$201, DW_AT_TI_symbol_name("CH_MAP_20")
    2759        .dwattr $C$DW$201, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2760        .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2761        .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2762        .dwattr $C$DW$201, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2763        .dwattr $C$DW$201, DW_AT_decl_line(0x14b)
    2764        .dwattr $C$DW$201, DW_AT_decl_column(0x0d)
    2765$C$DW$202       .dwtag  DW_TAG_member
    2766        .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$11)
    2767        .dwattr $C$DW$202, DW_AT_name("rsvd4")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   53

    2768        .dwattr $C$DW$202, DW_AT_TI_symbol_name("rsvd4")
    2769        .dwattr $C$DW$202, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2770        .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2771        .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2772        .dwattr $C$DW$202, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2773        .dwattr $C$DW$202, DW_AT_decl_line(0x14c)
    2774        .dwattr $C$DW$202, DW_AT_decl_column(0x0d)
    2775$C$DW$203       .dwtag  DW_TAG_member
    2776        .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$11)
    2777        .dwattr $C$DW$203, DW_AT_name("CH_MAP_21")
    2778        .dwattr $C$DW$203, DW_AT_TI_symbol_name("CH_MAP_21")
    2779        .dwattr $C$DW$203, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2780        .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2781        .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2782        .dwattr $C$DW$203, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2783        .dwattr $C$DW$203, DW_AT_decl_line(0x14d)
    2784        .dwattr $C$DW$203, DW_AT_decl_column(0x0d)
    2785$C$DW$204       .dwtag  DW_TAG_member
    2786        .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$11)
    2787        .dwattr $C$DW$204, DW_AT_name("rsvd12")
    2788        .dwattr $C$DW$204, DW_AT_TI_symbol_name("rsvd12")
    2789        .dwattr $C$DW$204, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2790        .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2791        .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2792        .dwattr $C$DW$204, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2793        .dwattr $C$DW$204, DW_AT_decl_line(0x14e)
    2794        .dwattr $C$DW$204, DW_AT_decl_column(0x0d)
    2795$C$DW$205       .dwtag  DW_TAG_member
    2796        .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$11)
    2797        .dwattr $C$DW$205, DW_AT_name("CH_MAP_22")
    2798        .dwattr $C$DW$205, DW_AT_TI_symbol_name("CH_MAP_22")
    2799        .dwattr $C$DW$205, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2800        .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2801        .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2802        .dwattr $C$DW$205, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2803        .dwattr $C$DW$205, DW_AT_decl_line(0x14f)
    2804        .dwattr $C$DW$205, DW_AT_decl_column(0x0d)
    2805$C$DW$206       .dwtag  DW_TAG_member
    2806        .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$11)
    2807        .dwattr $C$DW$206, DW_AT_name("rsvd20")
    2808        .dwattr $C$DW$206, DW_AT_TI_symbol_name("rsvd20")
    2809        .dwattr $C$DW$206, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    2810        .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2811        .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2812        .dwattr $C$DW$206, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2813        .dwattr $C$DW$206, DW_AT_decl_line(0x150)
    2814        .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    2815$C$DW$207       .dwtag  DW_TAG_member
    2816        .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$11)
    2817        .dwattr $C$DW$207, DW_AT_name("CH_MAP_23")
    2818        .dwattr $C$DW$207, DW_AT_TI_symbol_name("CH_MAP_23")
    2819        .dwattr $C$DW$207, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    2820        .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2821        .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2822        .dwattr $C$DW$207, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   54

    2823        .dwattr $C$DW$207, DW_AT_decl_line(0x151)
    2824        .dwattr $C$DW$207, DW_AT_decl_column(0x0d)
    2825$C$DW$208       .dwtag  DW_TAG_member
    2826        .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$11)
    2827        .dwattr $C$DW$208, DW_AT_name("rsvd28")
    2828        .dwattr $C$DW$208, DW_AT_TI_symbol_name("rsvd28")
    2829        .dwattr $C$DW$208, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2830        .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2831        .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2832        .dwattr $C$DW$208, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2833        .dwattr $C$DW$208, DW_AT_decl_line(0x152)
    2834        .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
    2835        .dwendtag $C$DW$T$43
    2836
    2837        .dwattr $C$DW$T$43, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2838        .dwattr $C$DW$T$43, DW_AT_decl_line(0x14a)
    2839        .dwattr $C$DW$T$43, DW_AT_decl_column(0x12)
    2840$C$DW$T$232     .dwtag  DW_TAG_volatile_type
    2841        .dwattr $C$DW$T$232, DW_AT_type(*$C$DW$T$43)
    2842
    2843$C$DW$T$44      .dwtag  DW_TAG_structure_type
    2844        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    2845$C$DW$209       .dwtag  DW_TAG_member
    2846        .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$11)
    2847        .dwattr $C$DW$209, DW_AT_name("CH_MAP_24")
    2848        .dwattr $C$DW$209, DW_AT_TI_symbol_name("CH_MAP_24")
    2849        .dwattr $C$DW$209, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2850        .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2851        .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2852        .dwattr $C$DW$209, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2853        .dwattr $C$DW$209, DW_AT_decl_line(0x15c)
    2854        .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    2855$C$DW$210       .dwtag  DW_TAG_member
    2856        .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$11)
    2857        .dwattr $C$DW$210, DW_AT_name("rsvd4")
    2858        .dwattr $C$DW$210, DW_AT_TI_symbol_name("rsvd4")
    2859        .dwattr $C$DW$210, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2860        .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2861        .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2862        .dwattr $C$DW$210, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2863        .dwattr $C$DW$210, DW_AT_decl_line(0x15d)
    2864        .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    2865$C$DW$211       .dwtag  DW_TAG_member
    2866        .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$11)
    2867        .dwattr $C$DW$211, DW_AT_name("CH_MAP_25")
    2868        .dwattr $C$DW$211, DW_AT_TI_symbol_name("CH_MAP_25")
    2869        .dwattr $C$DW$211, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2870        .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2871        .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2872        .dwattr $C$DW$211, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2873        .dwattr $C$DW$211, DW_AT_decl_line(0x15e)
    2874        .dwattr $C$DW$211, DW_AT_decl_column(0x0d)
    2875$C$DW$212       .dwtag  DW_TAG_member
    2876        .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$11)
    2877        .dwattr $C$DW$212, DW_AT_name("rsvd12")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   55

    2878        .dwattr $C$DW$212, DW_AT_TI_symbol_name("rsvd12")
    2879        .dwattr $C$DW$212, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2880        .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2881        .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2882        .dwattr $C$DW$212, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2883        .dwattr $C$DW$212, DW_AT_decl_line(0x15f)
    2884        .dwattr $C$DW$212, DW_AT_decl_column(0x0d)
    2885$C$DW$213       .dwtag  DW_TAG_member
    2886        .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$11)
    2887        .dwattr $C$DW$213, DW_AT_name("CH_MAP_26")
    2888        .dwattr $C$DW$213, DW_AT_TI_symbol_name("CH_MAP_26")
    2889        .dwattr $C$DW$213, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2890        .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2891        .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2892        .dwattr $C$DW$213, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2893        .dwattr $C$DW$213, DW_AT_decl_line(0x160)
    2894        .dwattr $C$DW$213, DW_AT_decl_column(0x0d)
    2895$C$DW$214       .dwtag  DW_TAG_member
    2896        .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$11)
    2897        .dwattr $C$DW$214, DW_AT_name("rsvd20")
    2898        .dwattr $C$DW$214, DW_AT_TI_symbol_name("rsvd20")
    2899        .dwattr $C$DW$214, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    2900        .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2901        .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2902        .dwattr $C$DW$214, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2903        .dwattr $C$DW$214, DW_AT_decl_line(0x161)
    2904        .dwattr $C$DW$214, DW_AT_decl_column(0x0d)
    2905$C$DW$215       .dwtag  DW_TAG_member
    2906        .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$11)
    2907        .dwattr $C$DW$215, DW_AT_name("CH_MAP_27")
    2908        .dwattr $C$DW$215, DW_AT_TI_symbol_name("CH_MAP_27")
    2909        .dwattr $C$DW$215, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    2910        .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2911        .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2912        .dwattr $C$DW$215, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2913        .dwattr $C$DW$215, DW_AT_decl_line(0x162)
    2914        .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    2915$C$DW$216       .dwtag  DW_TAG_member
    2916        .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$11)
    2917        .dwattr $C$DW$216, DW_AT_name("rsvd28")
    2918        .dwattr $C$DW$216, DW_AT_TI_symbol_name("rsvd28")
    2919        .dwattr $C$DW$216, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2920        .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2921        .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2922        .dwattr $C$DW$216, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2923        .dwattr $C$DW$216, DW_AT_decl_line(0x163)
    2924        .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    2925        .dwendtag $C$DW$T$44
    2926
    2927        .dwattr $C$DW$T$44, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2928        .dwattr $C$DW$T$44, DW_AT_decl_line(0x15b)
    2929        .dwattr $C$DW$T$44, DW_AT_decl_column(0x12)
    2930$C$DW$T$234     .dwtag  DW_TAG_volatile_type
    2931        .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$44)
    2932
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   56

    2933$C$DW$T$45      .dwtag  DW_TAG_structure_type
    2934        .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    2935$C$DW$217       .dwtag  DW_TAG_member
    2936        .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$11)
    2937        .dwattr $C$DW$217, DW_AT_name("CH_MAP_28")
    2938        .dwattr $C$DW$217, DW_AT_TI_symbol_name("CH_MAP_28")
    2939        .dwattr $C$DW$217, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    2940        .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2941        .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2942        .dwattr $C$DW$217, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2943        .dwattr $C$DW$217, DW_AT_decl_line(0x16d)
    2944        .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    2945$C$DW$218       .dwtag  DW_TAG_member
    2946        .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$11)
    2947        .dwattr $C$DW$218, DW_AT_name("rsvd4")
    2948        .dwattr $C$DW$218, DW_AT_TI_symbol_name("rsvd4")
    2949        .dwattr $C$DW$218, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    2950        .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2951        .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2952        .dwattr $C$DW$218, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2953        .dwattr $C$DW$218, DW_AT_decl_line(0x16e)
    2954        .dwattr $C$DW$218, DW_AT_decl_column(0x0d)
    2955$C$DW$219       .dwtag  DW_TAG_member
    2956        .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$11)
    2957        .dwattr $C$DW$219, DW_AT_name("CH_MAP_29")
    2958        .dwattr $C$DW$219, DW_AT_TI_symbol_name("CH_MAP_29")
    2959        .dwattr $C$DW$219, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    2960        .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2961        .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2962        .dwattr $C$DW$219, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2963        .dwattr $C$DW$219, DW_AT_decl_line(0x16f)
    2964        .dwattr $C$DW$219, DW_AT_decl_column(0x0d)
    2965$C$DW$220       .dwtag  DW_TAG_member
    2966        .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$11)
    2967        .dwattr $C$DW$220, DW_AT_name("rsvd12")
    2968        .dwattr $C$DW$220, DW_AT_TI_symbol_name("rsvd12")
    2969        .dwattr $C$DW$220, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    2970        .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2971        .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2972        .dwattr $C$DW$220, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2973        .dwattr $C$DW$220, DW_AT_decl_line(0x170)
    2974        .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    2975$C$DW$221       .dwtag  DW_TAG_member
    2976        .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$11)
    2977        .dwattr $C$DW$221, DW_AT_name("CH_MAP_30")
    2978        .dwattr $C$DW$221, DW_AT_TI_symbol_name("CH_MAP_30")
    2979        .dwattr $C$DW$221, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2980        .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2981        .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2982        .dwattr $C$DW$221, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2983        .dwattr $C$DW$221, DW_AT_decl_line(0x171)
    2984        .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    2985$C$DW$222       .dwtag  DW_TAG_member
    2986        .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$11)
    2987        .dwattr $C$DW$222, DW_AT_name("rsvd20")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   57

    2988        .dwattr $C$DW$222, DW_AT_TI_symbol_name("rsvd20")
    2989        .dwattr $C$DW$222, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    2990        .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2991        .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2992        .dwattr $C$DW$222, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    2993        .dwattr $C$DW$222, DW_AT_decl_line(0x172)
    2994        .dwattr $C$DW$222, DW_AT_decl_column(0x0d)
    2995$C$DW$223       .dwtag  DW_TAG_member
    2996        .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$11)
    2997        .dwattr $C$DW$223, DW_AT_name("CH_MAP_31")
    2998        .dwattr $C$DW$223, DW_AT_TI_symbol_name("CH_MAP_31")
    2999        .dwattr $C$DW$223, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    3000        .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3001        .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3002        .dwattr $C$DW$223, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    3003        .dwattr $C$DW$223, DW_AT_decl_line(0x173)
    3004        .dwattr $C$DW$223, DW_AT_decl_column(0x0d)
    3005$C$DW$224       .dwtag  DW_TAG_member
    3006        .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$11)
    3007        .dwattr $C$DW$224, DW_AT_name("rsvd28")
    3008        .dwattr $C$DW$224, DW_AT_TI_symbol_name("rsvd28")
    3009        .dwattr $C$DW$224, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    3010        .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3011        .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3012        .dwattr $C$DW$224, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    3013        .dwattr $C$DW$224, DW_AT_decl_line(0x174)
    3014        .dwattr $C$DW$224, DW_AT_decl_column(0x0d)
    3015        .dwendtag $C$DW$T$45
    3016
    3017        .dwattr $C$DW$T$45, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    3018        .dwattr $C$DW$T$45, DW_AT_decl_line(0x16c)
    3019        .dwattr $C$DW$T$45, DW_AT_decl_column(0x12)
    3020$C$DW$T$236     .dwtag  DW_TAG_volatile_type
    3021        .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$45)
    3022
    3023$C$DW$T$46      .dwtag  DW_TAG_structure_type
    3024        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    3025$C$DW$225       .dwtag  DW_TAG_member
    3026        .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$11)
    3027        .dwattr $C$DW$225, DW_AT_name("CH_MAP_32")
    3028        .dwattr $C$DW$225, DW_AT_TI_symbol_name("CH_MAP_32")
    3029        .dwattr $C$DW$225, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    3030        .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3031        .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3032        .dwattr $C$DW$225, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    3033        .dwattr $C$DW$225, DW_AT_decl_line(0x17e)
    3034        .dwattr $C$DW$225, DW_AT_decl_column(0x0d)
    3035$C$DW$226       .dwtag  DW_TAG_member
    3036        .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$11)
    3037        .dwattr $C$DW$226, DW_AT_name("rsvd4")
    3038        .dwattr $C$DW$226, DW_AT_TI_symbol_name("rsvd4")
    3039        .dwattr $C$DW$226, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    3040        .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3041        .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3042        .dwattr $C$DW$226, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
PRU Assembler Unix v2.1.2 Wed Sep  7 12:11:05 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
mcp3202.asm                                                          PAGE   58

    3043        .dwattr $C$DW$226, DW_AT_decl_line(0x17f)
    3044        .dwattr $C$DW$226, DW_AT_decl_column(0x0d)
    3045$C$DW$227       .dwtag  DW_TAG_member
    3046        .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$11)
    3047        .dwattr $C$DW$227, DW_AT_name("CH_MAP_33")
    3048        .dwattr $C$DW$227, DW_AT_TI_symbol_name("CH_MAP_33")
    3049        .dwattr $C$DW$227, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    3050        .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3051        .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3052        .dwattr $C$DW$227, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    3053        .dwattr $C$DW$227, DW_AT_decl_line(0x180)
    3054        .dwattr $C$DW$227, DW_AT_decl_column(0x0d)
    3055$C$DW$228       .dwtag  DW_TAG_member
    3056        .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$11)
    3057        .dwattr $C$DW$228, DW_AT_name("rsvd12")
    3058        .dwattr $C$DW$228, DW_AT_TI_symbol_name("rsvd12")
    3059        .dwattr $C$DW$228, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    3060        .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3061        .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3062        .dwattr $C$DW$228, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    3063        .dwattr $C$DW$228, DW_AT_decl_line(0x181)
    3064        .dwattr $C$DW$228, DW_AT_decl_column(0x0d)
    3065$C$DW$229       .dwtag  DW_TAG_member
    3066        .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$11)
    3067        .dwattr $C$DW$229, DW_AT_name("CH_MAP_34")
    3068        .dwattr $C$DW$229, DW_AT_TI_symbol_name("CH_MAP_34")
    3069        .dwattr $C$DW$229, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    3070        .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3071        .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3072        .dwattr $C$DW$229, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    3073        .dwattr $C$DW$229, DW_AT_decl_line(0x182)
    3074        .dwattr $C$DW$229, DW_AT_decl_column(0x0d)
    3075$C$DW$230       .dwtag  DW_TAG_member
    3076        .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$11)
    3077        .dwattr $C$DW$230, DW_AT_name("rsvd20")
    3078        .dwattr $C$DW$230, DW_AT_TI_symbol_name("rsvd20")
    3079        .dwattr $C$DW$230, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    3080        .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3081        .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3082        .dwattr $C$DW$230, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    3083        .dwattr $C$DW$230, DW_AT_decl_line(0x183)
    3084        .dwattr $C$DW$230, DW_AT_decl_column(0x0d)
    3085$C$DW$231       .dwtag  DW_TAG_member
    3086        .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$11)
    3087        .dwattr $C$DW$231, DW_AT_name("CH_MAP_35")
    3088        .dwattr $C$DW$231, DW_AT_TI_symbol_name("CH_MAP_35")
    3089        .dwattr $C$DW$231, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    3090        .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3091        .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3092        .dwattr $C$DW$231, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/pru/include/pru_intc.h")
    3093        .dwattr $C$DW$231, DW_AT_decl_line(0x184)
